["Spinner: White decorative\n\n\n\nSpinner: White decorative\n\nAgree & Join 13WHAM\n\nBy continuing, I agree to the Terms & Conditions and acknowledge that I have read the Privacy Policy.\n\nstation icon\n\nDownload the AppGet your news faster with our mobile experience\n\nInstall\n\nheader logo\n\nNews\n\nNews\n\n\n\n\\ \\ Beloved Clarkson bar targeted in burglary, leaving owners and patrons seeking answers\n\n\n\n\\ \\ Brighton celebrates diversity with annual Pride event themed 'Fabric of Freedom'\n\n\n\n\\ \\ Driver ticketed after crashing dump truck into tree to avoid cars in Avon\n\n\n\n\\ \\ 'World's biggest bounce house' in Rochester area this weekend\n\nLocal\n\nNation & World\n\nTraffic\n\nOffbeat\n\nEntertainment\n\nCrime Stoppers\n\nConnect to Congress\n\nElection\n\nArmstrong Army Strong\n\nAmazing America\n\nInside Your World\n\nQuestion of the Day\n\nSpotlight on America\n\nFull Measure with Sharyl Attkisson\n\nElection Results\n\nCrisis in the Classroom\n\nGood Day & ARC Rochester\n\nBlack History Month\n\nABC logo\n\nWeather\n\nCurrent Weather\n\nRochester \\ \\ Mostly Cloudy\\ \\\n\n\n\n\\ \\ 71\\ \\ 91\\ \\ 68\\ \\ Today\\\n\n\n\n\\ \\ 91\\ \\ 68\\ \\ Sunday\\\n\n\n\n\\ \\ 85\\ \\ 72\\ \\ Monday\\\n\n\n\n\\ \\ 88\\ \\ 66\n\n\n\n\\ Latest Weathercast\n\nSchool Visit Request\n\nRadar\n\nMaps\n\nClosings\n\nSubmit a Closing\n\nSki Report\n\nWeather Talk\n\nSchool Pictures\n\nMini Meteorologist\n\nABC logo\n\nBuffalo Plus\n\nBuffalo Plus\n\n\n\n\\ \\ Penfield native excited to return home as director of HBO's 'Hard Knocks' with Bills\n\n\n\n\\ \\ Trailer released for Bills-themed Hallmark Christmas movie\n\n\n\n\\ \\ Bills first-round draft pick Maxwell Hairston accused of sexual assault\n\n\n\n\\ \\ Bills announce 2025 training camp schedule\n\nBills Latest News\n\nABC logo\n\nHealth Matters\n\nHealth Matters\n\n\n\n\\ \\ Your Health: July 11, 2025\n\n\n\n\\ \\ Your Health: July 4, 2025\n\n\n\n\\ \\ Your Health: June 27, 2025\n\n\n\n\\ \\ Your Health: June 20, 2025\n\nYour Health\n\nABC logo\n\nGame Center\n\nGame Center\n\n\n\n\n\n\n\n\n\nGame Center\n\nABC logo\n\nWatch\n\nNow\\ \\ 71\\ \\ Sun\\ \\ 85\\ \\ Mon \\ \\ 88\n\nNavigate to Watch page\n\nsearch icon\n\nprofile icon\n\nNews\n\narrow symbol\n\nLocal\n\nNation & World\n\nTraffic\n\nOffbeat\n\nEntertainment\n\nCrime Stoppers\n\nConnect to Congress\n\nElection\n\nArmstrong Army Strong\n\nAmazing America\n\nInside Your World\n\nQuestion of the Day\n\nSpotlight on America\n\nFull Measure with Sharyl Attkisson\n\nElection Results\n\nCrisis in the Classroom\n\nGood Day & ARC Rochester\n\nBlack History Month\n\nWeather\n\narrow symbol\n\nWeather Home\n\nSchool Visit Request\n\nRadar\n\nMaps\n\nClosings\n\nSubmit a Closing\n\nSki Report\n\nWeather Talk\n\nSchool Pictures\n\nMini Meteorologist\n\nBuffalo Plus\n\narrow symbol\n\nBuffalo Plus Home\n\nBills Latest News\n\nHealth Matters\n\narrow symbol\n\nHealth Matters Home\n\nYour Health\n\nGame Center\n\narrow symbol\n\nGame Center Home\n\nGame Center\n\nMoney\n\narrow symbol\n\nMoney Home\n\nDeposits\n\nInvesting\n\nMortgages\n\nLoans\n\nCredit Cards\n\nChime In\n\nSports\n\narrow symbol\n\nSports Home\n\nColleges\n\nPickin’ Splinters\n\nHS Sports Report\n\nHS Play of the Week\n\nBills\n\nSabres\n\nRed Wings\n\nAmerks\n\nKnighthawks\n\nOrange\n\nTICKETS\n\nCity Guide\n\nCommunity\n\narrow symbol\n\nCommunity Home\n\nGood Day Rochester\n\nBright Spot\n\nBirthday Club\n\nMany Voices\n\nCheapest Gas\n\nFurry Fan Page\n\nCommunity Connection\n\nJazz Lounge\n\nSinclair Cares\n\nPartner Spotlight\n\nKeep On Cooking\n\nFor Pet's Sake\n\nHire Me Rochester\n\nSmart Living\n\nFall in Love with New York\n\nMoney Cents\n\nFlower City Fare\n\nFrom the Ground Up\n\nGolisano Children's Hospital\n\nStation\n\narrow symbol\n\nStation Home\n\nContact\n\nNews Team\n\nDiversity & Inclusion\n\nContests\n\nSchedule\n\nFOX Rochester\n\nCW Rochester\n\nAdvertise With Us\n\nCareers\n\nNewsletter Sign Up\n\nVideos\n\nLawmakers\n\nLegal\n\narrow symbol\n\nTerms & Conditions\n\nCopyright Notices\n\nPrivacy & Cookie Policy\n\nFCC Info\n\nFCC Applications\n\nContact\n\nPublic File Assistance\n\nNews Team\n\nContests\n\nDiversity & Inclusion\n\nPrivacy Policy\n\nCookie Policy\n\nCookie Preferences\n\nSaved Storiesnew\n\nFacebook icon\n\nX icon\n\nTiktok icon\n\nUserWay icon for accessibility widget\n\nACCESSIBILITY\n\nConcern over food additives banned in Europe but not US\n\nbyANGIE MORESCHI and NATHAN AARON\n\nThu, October 3rd 2024 at 5:21 PM\n\nUpdated Fri, October 4th 2024 at 6:14 AM\n\nUserWay icon for accessibility widget\n\nU.S. products that contain at least one food additive banned in Europe but allowed in U.S. (SOA)\n\nPlay/Pause\n\nVideo Quality\n\nSpeed0.25x0.5xnormal1.5x2x\n\nAudio Track\n\nAudio Quality\n\nSubtitlesopen\n\nFont sizedefault50%75%100%150%200%300%400%\n\nFont styledefaultitalicbold\n\nFont familydefaultmonospaced serifproportional serifmonospaced sans serifproportional sans serifcasualcursivesmall capital\n\nFont colordefaultwhiteblackredgreenbluecyanyellowmagenta\n\nFont opacitydefault100%75%50%25%\n\nCharacter edgedefaultraiseddepresseduniformdrop shadowed\n\nCharacter edge colordefaultwhiteblackredgreenbluecyanyellowmagenta\n\nBackground colordefaultwhiteblackredgreenbluecyanyellowmagenta\n\nBackground opacitydefault100%75%50%25%0%\n\nWindow colordefaultwhiteblackredgreenbluecyanyellowmagenta\n\nWindow opacitydefault100%75%50%25%0%\n\nBackReset\n\n00:01\n\n00:00\n\nPlayMute\n\nPicture-in-PictureApple AirPlayGoogle CastVRSettingsFullscreen\n\nReplay\n\nlogo\n\nSOA interviews Personal Trainer Push Mookim. (SOA)\n\nNutritionist Kristina Martin is concerned about certain food additives in U.S. products. (SOA)\n\nImage icon\n\n\\ \\ 10\\ \\ VIEW ALL PHOTOS\\ \\\n\nView All Photos\n\nU.S. products that contain at least one food additive banned in Europe but allowed in U.S. (SOA)\n\nSave this story to your profile\n\nSave Story\n\nShare story\n\nShare\n\nTOPICS:\n\nFood additives Banned U.S. Europe Safety Red Dye 3 Titanium Dioxide Carcinogens\n\nSome of the foods you and your family could be eating contain ingredients banned in other countries but still legal here in the U.S. Some of those additives are suspected of causing cancer, even changes in DNA.\n\nIn this report, Spotlight on America investigates concern that a more lax approach to regulating food chemicals in the U.S. could be putting consumers at risk.\n\nPlay/Pause\n\nVideo Quality\n\nSpeed0.25x0.5xnormal1.5x2x\n\nAudio Track\n\nAudio Quality\n\nSubtitlesopen\n\nFont sizedefault50%75%100%150%200%300%400%\n\nFont styledefaultitalicbold\n\nFont familydefaultmonospaced serifproportional serifmonospaced sans serifproportional sans serifcasualcursivesmall capital\n\nFont colordefaultwhiteblackredgreenbluecyanyellowmagenta\n\nFont opacitydefault100%75%50%25%\n\nCharacter edgedefaultraiseddepresseduniformdrop shadowed\n\nCharacter edge colordefaultwhiteblackredgreenbluecyanyellowmagenta\n\nBackground colordefaultwhiteblackredgreenbluecyanyellowmagenta\n\nBackground opacitydefault100%75%50%25%0%\n\nWindow colordefaultwhiteblackredgreenbluecyanyellowmagenta\n\nWindow opacitydefault100%75%50%25%0%\n\nBackReset\n\n00:01\n\n00:00\n\nPlayMute\n\nPicture-in-PictureApple AirPlayGoogle CastVRSettingsFullscreen\n\nReplay\n\nlogo\n\nSOA investigative correspondent Angie Moreschi reports on concern over food additives banned in Europe but not the U.S.\n\nFood additive safety\n\nChemical additives in things like candy corn and other treats and foods sold here in the United States are causing concern for people like Push Mookim, a certified personal trainer with AAG Fitness in Arlington, Virginia.\n\n\n\nSOA interviews Personal Trainer Push Mookim. (SOA)\n\nMookim is a self-avowed label reader, who is very careful about the food he puts in his body.\n\n“My main concern is the unknown. A lot of this stuff, we don't really know what it's doing to us,” Mookim said.\n\nMost Americans are likely unaware that some additives in our food are considered dangerous in Europe.\n\n“I certainly wouldn't go to a grocery store and pick up an item and think to myself, ‘I wonder if it has carcinogens in it. I wouldn't think to myself this candy that I've been seeing for years and years and years on the market could be contributing to neurobehavioral issues or cause memory loss and tremors, all kinds of things,” Nutritionist Kristina Martin told Spotlight.\n\nAdditives Banned in Europe – Legal in U.S.\n\nFood additives banned in Europe but still allowed here in the U.S. include:\n\nRed dye 3 – coloring agent, suspected carcinogen\n\nTitanium dioxide– also a coloring agent, which research shows can accumulate in the body and potentially damage DNA\n\nPotassium Bromate– another suspected carcinogen, used to improve texture in breads and other baked goods.\n\nPropylparaben– a preservative, shown to potentially disrupt fertility and endocrine function.\n\nBrominated Vegetable Oil (BVO)– used in citrus drinks ( Just banned in the U.S. this summer, after nearly 20-years of being banned in Europe.)\n\n\n\nNutritionist Kristina Martin is concerned about certain food additives in U.S. products. (SOA)\n\nMartin says, unfortunately, the burden is on consumers to be label readers to look for additives like Red Dye 3, Titanium Dioxide, Propylparaben, Potassium Bromate, Brominated Vegetable Oil.\n\n“Most people can't pronounce the names, which I think is always a really good indicator that it’s probably not the best for you,” she said.\n\nRed Dye 3 Concerns\n\nRed Dye 3 is one of the additives creating significant concern.\n\nThe chemical is used to make food coloring more vibrant in U.S. products, including many treats often eaten by children, like Brach candy corn, but also in foods you might not suspect, like Vigo yellow rice.\n\n“The clearest example of FDA failure is the food dye Red 3,” said Thomas Galligan, principal scientist on additives at The Center for Science in the Public Interest. “This is a chemical that FDA, itself, determined in 1990 causes cancer when eaten by animals, but in 2024, it is still authorized for use in food today.”\n\nGalligan says Europe takes a more precautionary approach to evaluating chemicals and additives compared to the United States.\n\nCPSI is critical of the Food and Drug Administration, the federal agency responsible for overseeing the safety of chemicals in our foods, for taking too long to reevaluate the safety of additives, when new research shows they can cause potential harm.\n\n\n\nCSPI Principal Scientist on Additives Thomas Galligan being interviewed by SOA. (SOA)\n\n“This is an ongoing, pretty egregious failure by the agency, in our opinion,” Galligan said.\n\nThe FDA delisted Red Dye 3 for use in cosmetics back in 1990, after evidence emerged that it causes cancer in lab animals, but action to ban its use in U.S. food stalled.\n\n“Thirty-four years have elapsed from acknowledging that this substance causes cancer in animals and action no action to this plan,” Galligan said.\n\nCSPI has filed a petition with the FDA asking the agency to ban Red 3, but Galligan says his organization has not received a response to their request.\n\nFDA Response\n\nSpotlight on America requested an interview with the FDA to discuss why additives banned and considered harmful in other countries are still legal here in the U.S. The agency declined, but a spokesperson told us in an email, “Just because an ingredient is not authorized for use in a specific country doesn’t mean that is unsafe at levels for which it is used in another country.”\n\nIn addition, the FDA indicated to Spotlight that the amount of a chemical in a food is part of their consideration: “Our thorough review process considers potential health risks over a lifetime of dietary exposure to ensure the safety of these chemicals.”\n\nAfter an independent expert review and critical report following the baby formula crisis in 2022, the FDA is setting new goals for its human food program. The agency’s website says it is working to \"enhance its approach to food chemical safety.\"\n\n“What their report revealed was that there are some cultural and structural problems within the agency that prevent it from doing its job effectively,” Galligan said.\n\nThe FDA website says it is implementing a goal to “update processes to identify, evaluate, prioritize and communicate new and evolving information to determine if reassessment of a chemical by the FDA is warranted,” but includes a caveat saying, more resources are needed to “ensure more steady progress.”\n\nBeing a label reader\n\n\n\nPersonal Trainer Push Mookim working out in Arlington, VA park. (SOA)\n\nPressure from health-conscious Americans has pushed the FDA to ban certain ingredients, like BVO this summer, but in many cases, consumers are unaware of the potential risk.\n\nRed Dye 3, in particular, is one that the Nutritionist Kristine Martin said she always tells clients to avoid when purchasing products, because it’s easy to remember.\n\n“It’s found in 1000’s of foods, from things like this to sugary beverages, even some baby foods,” Martin said.\n\n\n\nEntenmann's Little Bites Party muffins show Red Dye 3, which the company told Spotlight it is phasing out by the end of the year. (SOA)\n\nOn a recent trip to the grocery store, Spotlight on America found Red Dye 3 in products like Brach Candy Corn, Entenmann’s Little Bites Party Cake Muffins, and even products you might not suspect, like Vigo Yellow Rice.\n\nMartin is also concerned about Titanium Dioxide, because it’s in a lot of products that children consume. Studies have indicated it can potentially impact DNA.\n\nSpotlight on America found Titanium Dioxide listed as an ingredient in products like Hostess Cupcakes and Little Debbie Oatmeal Cream Pies.\n\nWe contacted all the food companies mentioned in our report for comment. Only two responded with statements: Entenmann’s, which makes the mini muffins and McKee Foods, which makes Little Debbie products.\n\nEntenmanns told us in an email: “We are phasing out red dye 3 in all Entenmann's products and expect this change to be implemented by the end of the year.”\n\nThe maker of Little Debbie products told Spotlight: “McKee Foods remains compliant with the FDA regulations regarding the safe use of titanium dioxide. It is the second least present ingredient in Little Debbie Oatmeal Cream Pies. At this time, we do not have concern about an ingredient that is declared safe by the FDA as long as it makes up less than 1% of the food’s total volume. There are currently no plans to eliminate this ingredient.”\n\n“DIRTY DOZEN” food chemicals to avoid\n\nEnvironmental Working Group is also a consumer advocacy group critical of the FDA for not taking action to ban several chemicals considered to be potentially harmful.\n\nEWG publishes a list of the top 12 food chemicals it recommends that consumers avoid, calling them the “dirty dozen.”\n\nThey include:\n\nPotassium bromate\n\nPropylparaben\n\nButylated hydroxyanisole (BHA)\n\nButylated hydroxytoluene (BHT)\n\nTitanium dioxide\n\nSeven artificial dyes\n\nAspartame\n\nAzodicarbonamide (ADA)\n\nPropyl gallate\n\nSodium benzoate\n\nMethylene chloride, trichloroethylene and ethylene dichloride\n\nSodium nitrite\n\nThe group is urging the public to submit comments to the FDA as the agency considers changes to its food safety review process. The deadline for the public to submit comments is Dec. 6.\n\nIncreasingly, states are taking the lead on banning ingredients the FDA has been slow to act upon.\n\nCalifornia was the first state to pass a new law in April banning several additives, including Red Dye 3.\n\nAt least 10 other states have now introduced similar bills, including New York, Washington, Pennsylvania, Maryland, West Virginia, Iowa, Missouri, Illinois, and Rhode Island.\n\nTrending\n\nImage for story: Man describes face-to-face encounter with mysterious large cat in Rochester\n\nMan describes face-to-face encounter with mysterious large cat in Rochester\n\nImage for story: DEC investigating viral video showing possible cougar in Rochester\n\nDEC investigating viral video showing possible cougar in Rochester\n\nImage for story: Man dies after Rochester crash\n\nMan dies after Rochester crash\n\nImage for story: Rochester businesses get creative to capitalize on reported mountain lion sightings\n\nRochester businesses get creative to capitalize on reported mountain lion sightings\n\nImage for story: Driver ticketed after crashing dump truck into tree to avoid cars in Avon\n\nDriver ticketed after crashing dump truck into tree to avoid cars in Avon\n\nStay Connected\n\nFacebook Icon\n\n\\ Like Us\n\nTwitter Icon\n\nFollow Us\n\nsbg-envelopeNewsletter Sign up/sign-up\n\n© 2025 Sinclair, Inc.\n\nTerms FCC FCC Privacy Policy Cookie Policy Cookie Preferences\n\nNews In Photos: \"Nation & World\"\n\nImage for story: New proposed bill aims to eliminate federal taxes on home sales, provide economic relief\n\n3\n\nNew proposed bill aims to eliminate federal taxes on home sales, provide economic relief\n\nImage for story: Former Epstein lawyer speaks out amid controversy\n\n3\n\nFormer Epstein lawyer speaks out amid controversy\n\nImage for story: Vermont communities face third consecutive summer of severe flooding, damage extensive\n\n5\n\nVermont communities face third consecutive summer of severe flooding, damage extensive\n\nImage for story: Bishop-elect sounds alarm on spiritual emergency among youth after carjacking\n\n3\n\nBishop-elect sounds alarm on spiritual emergency among youth after carjacking\n\nLoading ...\n\n", "+1 (630) 759-4981 info@halalfoundation.org\n\nFacebook\n\nFacebook\n\nA Comprehensive Guide to Halal and Haram Ingredients\n\nby Halal Foundation Editorial Team | Oct 24, 2024 | Food & Beverage\n\n\n\nThe following halal and haram ingredients list is developed in alignment with the book ‘ Islamic Dietary Laws and Practices’ by Mohammad Mazhar Hussaini.\n\nThis comprehensive guide will help you understand and identify halal and haram ingredients in detail.\n\nYou Might Also Like: The (Detailed) Halal Certification Process\n\nCommon Halal Ingredients for Muslims\n\nHere is a comprehensive list of commonly recognized halal ingredients:\n\n1. Meats and Poultry\n\nHalal-Certified Beef: Must be slaughtered in accordance with Islamic laws.\n\nHalal-Certified Lamb: Must be slaughtered in accordance with Islamic laws.\n\nHalal-Certified Chicken: Must be slaughtered in accordance with Islamic laws.\n\nHalal-Certified Turkey: Must be slaughtered in accordance with Islamic laws.\n\nHalal-Certified Goat: Must be slaughtered in accordance with Islamic laws.\n\nHalal-Certified Fish: All fish are considered halal without specific slaughter requirements.\n\nHalal-Certified Duck: Must be slaughtered in accordance with Islamic laws.\n\nHalal-Certified Rabbit: Must be slaughtered in accordance with Islamic laws.\n\n2. Dairy Products\n\nMilk: From cows, goats, and sheep, as long as no haram (forbidden) additives are included.\n\nCheese: Must be made with microbial rennet or halal-certified animal rennet.\n\nYogurt: Must not contain gelatin unless halal-certified.\n\nButter: Must be free from non-halal additives.\n\nCream: Must be free from non-halal additives.\n\n3. Grains and Cereals\n\nRice\n\nWheat\n\nOats\n\nBarley\n\nCorn\n\nQuinoa\n\nMillet\n\nBuckwheat\n\nSpelt\n\nChia Seeds\n\nFlaxseeds\n\nHemp Seeds\n\n4. Fruits and Vegetables\n\nFresh Fruits: Apples, bananas, oranges, grapes, etc.\n\nFresh Vegetables: Carrots, potatoes, spinach, etc.\n\nDried Fruits: Dates, raisins, apricots, etc.\n\nFrozen Vegetables: Must be free from haram additives.\n\n5. Legumes and Nuts\n\nBeans: Kidney beans, chickpeas, lentils, etc.\n\nPeas: Green peas, split peas, etc.\n\nNuts: Almonds, walnuts, cashews, etc.\n\nSeeds: Sunflower seeds, pumpkin seeds, etc.\n\n6. Proteins and Amino Acids:\n\nCasein: A protein found in milk, halal if not mixed with haram additives.\n\nHydrolyzed Vegetable Protein (HVP): Made from plant sources.\n\nWhey Protein Concentrate: Derived from milk, halal if not mixed with haram additives.\n\nSoy Protein Isolate: Derived from soybeans.\n\nL-Lysine: An essential amino acid, when synthesized from plant sources.\n\nL-Leucine: An essential amino acid, when derived from plant sources.\n\nL-Arginine: An amino acid, when derived from plant sources.\n\n7. Oils and Fats\n\nVegetable Oils: Olive oil, sunflower oil, canola oil, etc.\n\nButter: Must be free from non-halal additives.\n\nGhee: Must be free from non-halal additives.\n\nCoconut Oil: Must be free from non-halal additives.\n\nPalm Oil: Must be free from non-halal additives.\n\nSesame Oil: Must be free from non-halal additives.\n\n8. Sweeteners & Flavors\n\nSugar: Must be free from non-halal ingredients, processing aid, and/or contact with any other non-halal raw materials.\n\nHoney: Considered halal.\n\nMaple Syrup: Must be pure and free from non-halal additives.\n\nMolasses: Must be free from non-halal additives.\n\nAgave Nectar: Must be free from non-halal additives.\n\nStevia: Must be free from non-halal additives.\n\nDate Sugar: Must be free from non-halal additives.\n\n9. Spices and Seasonings\n\nSalt\n\nPepper\n\nTurmeric\n\nCumin\n\nCoriander\n\nCinnamon\n\nGinger\n\nGarlic\n\nOnion Powder\n\nBasil\n\nBay Leaves\n\nChili Powder\n\nCloves\n\nCurry Powder\n\nDill\n\nOregano\n\nParsley\n\nRosemary\n\nThyme\n\n10. Beverages\n\nWater\n\nJuices: Must be free from alcohol and non-halal additives.\n\nTea\n\nCoffee\n\nMilk: Must be from halal sources.\n\nHerbal Teas\n\nNon-Alcoholic Sparkling Drinks\n\n11. Condiments and Sauces\n\nKetchup: Must be free from non-halal additives.\n\nMustard: Must be free from non-halal additives.\n\nSoy Sauce: Must be free from alcohol.\n\nVinegar: Must be made without alcohol (malt vinegar is typically not halal).\n\nHot Sauce: Must be free from non-halal additives.\n\n12. Baked Goods and Confectioneries\n\nBread: Must be free from non-halal additives.\n\nPastries: Must be free from non-halal gelatin and alcohol.\n\nCookies: Must be free from non-halal gelatin and alcohol.\n\nCandies: Must be free from non-halal gelatin and alcohol.\n\nChocolates: Must be free from non-halal gelatin and alcohol.\n\n13. Additives and Preservatives\n\nE-numbers (EU food additive codes): Only specific ones are considered halal, such as:\n\nE100 (Curcumin)\n\nE101 (Riboflavin)\n\nE102 (Tartrazine)\n\nE110 (Sunset Yellow FCF)\n\nE120 (Cochineal/Carminic acid): Usually not halal unless derived from permissible sources.\n\nE140 (Chlorophylls)\n\nE141 (Copper complexes of chlorophylls)\n\nE150a (Plain caramel)\n\nE160a (Carotenes)\n\nE162 (Beetroot Red, Betanin)\n\nE170 (Calcium Carbonate)\n\nE200 (Sorbic acid)\n\nE202 (Potassium sorbate)\n\nE210 (Benzoic acid)\n\nE211 (Sodium benzoate)\n\nE300 (Ascorbic acid)\n\nE322 (Lecithins): Must be derived from halal sources.\n\nSorbic Acid (E200): Used as a preservative.\n\nCalcium Propionate (E282): Used as a preservative in baked goods.\n\nPotassium Sorbate (E202): Used as a preservative.\n\n14. Food Colorings:\n\nCarotenoids (E160a): Natural pigments found in plants.\n\nAnthocyanins (E163): Pigments found in berries and grapes.\n\nChlorophyll (E140): Natural green pigment in plants.\n\n15. Fermented Products:\n\nKimchi: A Korean fermented vegetable dish, typically halal if not mixed with non-halal ingredients.\n\nSauerkraut: Fermented cabbage, halal if not mixed with non-halal ingredients.\n\nKombucha: A fermented tea, halal if the alcohol content is negligible.\n\n16. Miscellaneous:\n\nAgar-Agar: A gelatinous substance derived from seaweed.\n\nCarob: A chocolate substitute made from the carob tree.\n\nArrowroot: A starch obtained from the rootstock of various tropical plants.\n\nGuar Gum: Derived from guar beans, used as a thickening agent.\n\nXanthan Gum: Produced by fermentation of sugar, used as a thickening agent.\n\nNote: This list is a starting point, but the halal status of ingredients can depend on processing methods and cross-contamination risks. For absolute certainty, it’s best to look for the halal certification logo on products and ingredients and if not present, request the manufacturers to obtain it.\n\nCommon Haram Ingredients for Muslims\n\nThe following list outlines commonly recognized haram ingredients that should be avoided:\n\n1. Alcohol and Related Ingredients\n\nEthanol: Any form of alcoholic beverages or ingredients extracted using alcohol.\n\nWine\n\nBeer\n\nLiquor\n\nFermented beverages\n\n2. Blood and blood by-products\n\nBlood plasma\n\nBlood sausage\n\n3. Meats and Poultry\n\nPork: Any part of the pig, including bacon, ham, and pork chops.\n\nGelatin: When derived from pig or non-halal slaughtered animals.\n\nLard: Fat from pigs, used in various food products.\n\nCarnivorous animals and birds of prey: Lions, Tigers, Hawks, etc\n\nAmphibians: Frogs, Toads, etc\n\nReptiles: Snakes, Crocodiles, etc\n\nInsects: Ants, Bees, Flies, etc\n\nNote: Meat from animals that died of themselves and from animals that were not slaughtered in the name of Allah are also considered haram.\n\n4. Dairy Products\n\nCheese with Non-Halal Rennet: Rennet derived from non-halal slaughtered animals.\n\nWhey from Non-Halal Sources: Used in ice creams and yogurts.\n\n5. Additives and Preservatives\n\nGelatin: Often derived from pig or non-halal animals, used in jellies and candies.\n\nMono and Diglycerides: Emulsifiers that could be derived from non-halal animal fats.\n\nLecithin from Non-Halal Sources: If derived from animals.\n\nRennet: From non-halal sources\n\nAnimal Shortening: Fats from non-halal animals.\n\nPepsin: An enzyme from pig stomachs, used in cheese production.\n\nLipase from pork\n\n6. Fats and Oils\n\nLard: Fat from pigs, used in baking and frying.\n\nNon-Halal Tallow: Animal fat not obtained from halal-slaughtered animals.\n\n6. Enzymes\n\nRennet: Often used in cheese, can be derived from non-halal sources.\n\nLipase: Enzymes that may come from non-halal animals.\n\n7. Vitamins and Supplements\n\nVitamins from Non-Halal Sources: Some vitamins, like Vitamin A and D, if derived from animal sources, might be haram unless certified halal.\n\n8. Sweeteners & Flavors\n\nGlycerol (Glycerine): Could be from animal, plant, or synthetic origin. If from animal sources, it is suspected.\n\nCertain Artificial Sweeteners: If derived from or processed with non-halal ingredients.\n\n9. Flavor Enhancers\n\nMSG (Monosodium Glutamate): If derived from non-halal sources, used to enhance flavor.\n\nArtificial Flavorings: Can contain non-halal derivatives.\n\n10. Miscellaneous\n\nHormones: Often animal-based, used for growth in meat production.\n\nBlood and Blood By-Products: Forbidden in any form.\n\nCochineal (Carmine): A red dye derived from insects, often considered haram.\n\nNote: For absolute certainty, it’s best to look for the halal symbol on processed and packaged foods and stay informed about ingredient sources and production methods.\n\nEvaluate Your Halal Status!\n\nUnderstanding and identifying halal and haram ingredients is crucial Muslims, as well as businesses wanting to target the substantially growing Muslim market.\n\nThe halal certification symbol is the ultimate symbol of trust for Muslims worldwide. Fill out this application to evaluate the halal nature of your product(s)/ facility!\n\nFrequently Asked Questions (FAQs)\n\nQ1: What does halal certification mean?\n\nA1: Halal certification is a process that verifies that products and their ingredients comply with Islamic dietary laws. This involves ensuring that no haram (forbidden) ingredients are used and that halal practices are followed in production, processing, and handling.\n\nQ2: Can a product be considered halal if it is produced with non-halal utensils?\n\nA2: For product(s) to be considered fully halal, it should not come into contact with non-halal utensils or surfaces. Cross-contamination can render halal ingredients haram, so using dedicated halal equipment is essential.\n\nQ3: Are there any halal substitutes for common haram ingredients?\n\nA3: Yes, there are many halal substitutes available for common haram ingredients. For example, agar-agar can be used instead of gelatin, and microbial rennet can be used in place of animal rennet in cheese production.\n\nQ4: What documentation is required for halal certification?\n\nA4: Typically, you will need to provide detailed information about your ingredients, production processes, supply chain, and quality control measures. Documentation may also include sourcing certificates and proof of adherence to hygiene and sanitation standards.\n\nQ5: Can we still produce non-halal products alongside halal-certified products?\n\nA5: Yes, it is possible, but you must ensure complete segregation to avoid cross-contamination. This includes separate production lines, storage facilities, and stringent cleaning protocols.\n\nQ6: How often do we need to renew our halal certification?\n\nA6: Halal certification typically needs to be renewed annually. The renewal process involves a reassessment of your operations to ensure continued compliance with halal standards.\n\nQ7: What kind of training will our staff need for halal certification?\n\nA7: Staff will need training on halal requirements, including ingredient handling, production processes, sanitation, and documentation procedures.\n\nOne of the most recognized halal symbols\n\nHalal Foundation Editorial Team\n\nBacked by more than 60+ years of combined experience in global halal standards and practices, the Halal Foundation Editorial Team is dedicated to delivering insightful, accurate, and practical content that empowers businesses and consumers to navigate the halal landscape.\n\nRelated posts:\n\n\n\nHow is Halal Certification Shaping International Food Standards\n\nHalal food spread out on table.\n\nIs Halal Food Healthy? Halal Food and What it Means for F&B\n\nFood\n\nCosmetics & Chemicals\n\nNutraceuticals & Pharmaceutical\n\nPackaging\n\nPrivate Label Brands\n\nIntegrated Audits\n\nOthers\n\nFood Icon\n\nFood\n\nBread & Bakeries Icon\n\nBread & Bakeries\n\nBeverages Icon\n\nBeverages\n\nCoffee Icon\n\nCoffee\n\nConfectionery Products Icon\n\nConfectionery Products\n\nDairy & Cheese Icon\n\nDairy & Cheese\n\nFood Icon\n\nFood Service\n\nEnzymes Icon\n\nFood Enzymes\n\nMeat and Poultry Icon\n\nMeat and Poultry\n\nNatural & Artificial Flavors Icon\n\nNatural & Artificial Food Flavors\n\nNuts Icon\n\nNuts & Dried Fruits\n\nCosmetics\n\nChemicals\n\nNutraceuticals\n\nPharmaceuticals\n\nPackaging\n\nPrivate Label Brands\n\nGluten-Free + Halal Certification\n\nNon-GMO + Halal Certification\n\nSQF + Halal Certification\n\nGovernment Facilities and Programs\n\nAnimal Feed\n\nCo-Manufacturing Facilities\n\nAHF Halal Standards\n\nAHF Halal Startup Gateway\n\nColleges & Universities\n\nTable of Contents\n\n→Index", "Back to All\n\nHalal Certified Cosmetics and Personal Care Products: Where Purity Comes First\n\nHaider Khattak\n\nDecember 31, 2008\n\nlink to facebook-flink to linkedinlink to twitterlink to envelope Copied!\n\nCosmetics and personal care products are a part and parcel of our daily lives. These include baby products, bath products, oral care products, skin care products, personal hygiene products, perfumes, deodorants and makeup. Cosmetics and personal care products must comply with government safety regulations. The Food, Drug and Cosmetic Act (FD&C Act) defines cosmetics by their intended use as “articles intended to be rubbed, poured, sprinkled, or sprayed on, introduced into, or otherwise applied to the human body… for cleansing, beautifying, promoting attractiveness, or altering the appearance” [FD&C Act, sec. 201(i)]. Among products included in this definition are skin moisturizers, perfumes, lipsticks, nail polishes, eye and facial makeup, shampoos, permanent waves, hair colors, toothpastes and deodorants, as well as other materials intended for use as a component of a cosmetic product. Some products meet the definitions of both cosmetics and drugs. This may happen when a product has two intended uses. For instance, a shampoo is a cosmetic because its intended use is to clean hair. An anti-dandruff treatment is a drug because its intended use is the treatment of dandruff. Consequently, an anti-dandruff shampoo is both a cosmetic and a drug (FDA 2002). FDA considers toothpaste as both a cosmetic and a drug because most toothpastes contain fluoride that is used to prevent tooth decay. However, FD&C Act Section 201(i)(2) excludes soap from the definition of a cosmetic. Health Canada (2008) defines cosmetics as products that clean, improve and/ or alter skin complexion, hair or teeth. All cosmetics sold to the public must meet the requirements of the Food and Drugs Act and the Cosmetic Regulations and the Consumer Packaging and Labeling Act.\n\nHistorically, plant based products have been used for cleaning, moisturizing, covering up blemishes and even treating minor skin conditions. Currently available skin care products are a concoction of several ingredients, some good, others questionable. For halal consumers, cosmetics and personal care products do present some challenges because they contain ingredients that make them questionable or Mashbooh.\n\nHere is an analysis of personal care products and their composition. A majority of these products include botanical ingredients. A botanical ingredient is a component of a cosmetic or personal care product that originates from plants (herbs, roots, flowers, fruits, leaves or seeds). Botanical ingredients are naturally halal, unless mixed with ingredients of animal origin. Some commonly used ingredients are discussed here.\n\nCetyl Alcohol, Cetearyl Alcohol, Myristyl Alcohol and Behenyl Alcohol are white, waxy solids, not related to ethyl alcohol. Cetyl Alcohol and Stearyl Alcohol are two major components of Cetearyl Alcohol. These ingredients are all fatty alcohols and occur naturally in small quantities in plants and animals. They are commonly used in cosmetics and personal care products, especially in skin lotions and creams. Dimethicone and Methicone, both silicone based polymers, are also considered halal, and used as anti-foaming agents or skin conditioning agents.\n\nEthyl alcohol or common alcohol, when used in non-food products, in most countries including the United States, is denatured alcohol. This means that a small amount of denaturant is added to the alcohol to make it taste bad. Alcohol Denat. is the general name used for denatured alcohol. Specific denatured alcohols that are permitted for use in cosmetics and personal care products include Specially Denatured (SD) Alcohol. Alcohol and Alcohol Denat. are used in many products including makeup, lotions, fragrance, shaving products, oral care, skin and hair care products.\n\nIsopropyl Alcohol is widely used in cosmetic and personal care products and can be found in nail, hair and skin care products including aftershave lotions, bath products, eye makeup and cleansing products.\n\nAll the above products with names ending in alcohol are not orally consumable products. They have no relation to Khamr, the common intoxicating alcoholic drink, and hence they are halal for use in skin care products.\n\nGlyceryl Stearate acts as a lubricant on the skin’s surface, and gives the skin a soft and smooth appearance. Glyceryl Stearate is made by reacting glycerine with stearic acid, a fatty acid obtained from animal and vegetable fats and oils. Polyethylene Glycol (PEG) Stearates are esters of polyethylene glycol and stearic acid. PEG Stearates are used in skin creams, conditioners, shampoos, body cleansers and soapless detergents. Sorbitan Stearates, Sorbitan Laurate, Sorbitan Sesquioleate, Sorbitan Oleate, Sorbitan Tristearate, Sorbitan Palmitate, Sorbitan Trioleate are used in a variety of products including skin care products, skin cleansing products, moisturizers, eye makeup and other makeup. These Sorbitan Esters are produced by reacting the polyol, sorbitol, with fatty acids. Obviously, animal derived ingredients are questionable and must be avoided. These ingredients are Mashbooh, and must be further investigated by calling manufacturers.\n\nButylene Glycol, Hexylene Glycol, Ethoxydiglycol and Dipropylene Glycol are clear, practically colorless, liquids. These ingredients are used in the formulation of hair and bath products, eye and facial makeup, fragrances, personal cleanliness products, shaving and skin care products. There are no halal concerns about these products.\n\nGlycerin is a sugar alcohol that can be obtained from natural sources or can be synthesized. Glycerin may be found in soaps, toothpaste, shaving cream, eyebrow pencils, lip colors, and skin and hair care products. Glycerin, also referred to as Glycerol, is a component of all animal and vegetable fats and oils. It can also be synthesized from carbohydrate materials or from substances such as petroleum. Vegetable derived glycerin and synthetic glycerin are considered halal. Consumers need to ask manufacturers whether Glycerin in a product is vegetable or animal based.\n\nSodium Laureth Sulfate and Ammonium Laureth Sulfate are used in the formulation of shampoos, bath products, and skin cleansing products but can also be found in other types of products. These ingredients exhibit a high degree of foaming and impart “softness” to the skin. Both ingredients are Mashbooh, as are Sodium Lauryl Sulfate and Ammonium Lauryl Sulfate.\n\nCollagen is used in many personal care products such as skin care and anti-aging creams. It is made from animal hides including pigs and may be labeled as hydrolyzed animal protein. Products containing collagen and hydrolyzed animal protein must be avoided.\n\nOzokerite, Ceresin and Montan Wax are mineral waxes, derived from coal and shale. Paraffin and Microcrystalline Wax are derived from petroleum. Emulsifying Wax and Synthetic Beeswax are manufactured waxes. These waxes are used in many types of products including lipsticks, baby products, eye and facial makeup, as well as nail care, skin care, suntan lotion, sunscreen, fragrances and non-coloring hair preparations. Ozokerite is a naturally occurring fossil wax found near soft shale. Most of the Ozokerite used in commercial applications is mined in Eastern Europe. It hardens on aging and its hardness varies according to its source and refinement. Ceresin is a white to yellow waxy mixture of hydrocarbons obtained by purification of Ozokerite. Montan Wax is a wax obtained by extraction of lignite (woody coals). Paraff in and Microcrystalline Wax are distillation products of petroleum. Emulsifying Wax is made from a mixture of cetyl and stearyl alcohol and polyoxyethylene derivatives of fatty acid esters of sorbitan. Synthetic Wax is a blend of low molecular weight polymers of ethylene. Synthetic Beeswax is a blend of fatty esters, fatty acids, fatty alcohols, and high molecular weight hydrocarbons. The properties of Synthetic Beeswax resemble beeswax. Since Synthetic Beeswax contains some critical ingredients, it becomes Mashbooh.\n\nIFANCA certifies some companies that produce halal certified personal care products such as Tom’s of Maine products that carry the IFANCA Crescent M halal logo. Sunrider International, Aloe Corp., At Last Naturals, and USANA Health Sciences all manufacture a large number of halal certified cosmetic products. These are listed on the IFANCA website www.IFANCA.org. IFANCA ensures that companies that receive halal certification meet required halal guidelines.\n\nQ & A with IFANCA Religious Advisor’s Sheikh Quaderi and Dr. Ahmad Sakr\n\nQ: Are Muslims permitted to use cosmetics and beauty products?\n\nSheikh Quaderi: Use of cosmetics and makeup that has been determined to be halal is permissible for women to wear if it is done in a manner that does not attract undue attention. When make-up is done in a manner that makes a person self-confident and pleasant (in appearance); and does not convey the impression of bad taste or negligence when it comes to appearance, it is permissible. But wearing excessive make-up, that attracts undue attention from others is not allowed. [God knows best]\n\nQ: Can we pray with nail polish on, if it has been applied after making the ablution (Wudu)?\n\nSheikh Quaderi: It is lawful to pray with nail polish on if one paints one’s nails after making ablution provided that the polish itself does not contain anything impure or forbidden by Sharia or Islamic law. However, if one makes ablution after nail polish has been applied, the ablution would not be complete, because nail polish keeps water from reaching the organ (nail) that needs to be ritually cleansed. [God knows best]\n\nQ: What about creams and other skin care products? Is their use permitted and can one make the ablution after applying cream?\n\nSheikh Quaderi: Creams, lotions and similar products are modern versions of oils intended to keep the skin healthy and pliable and to prevent dry skin. So there is no prohibition against the use of such products as long as they are free from Haram (not lawful for Muslims) or Mashbooh ingredients. As far as making ablution ( Wudu or Ghusl) after applying such a product, you have to know exactly what type of product you are using. They are two types; one that leaves a perceptible layer on the skin and the other that washes off easily. The first kind, such as lipstick, leaves a perceptible layer on the skin, and prevents water from getting to the skin or the organs that should be washed during ablution (or Ghusl). It must then be removed. The second kind is a cream or color that does not leave any perceptible layer on the skin but becomes part of the skin like henna or oil that doesn’t prevent water from reaching the skin. It is not obligatory to remove such a product before one makes the ablution. [God knows best]\n\nQ: How about the use of facial medicines such as anti-aging creams or anti-wrinkle products or even plastic surgery? Are those permitted in Islam?\n\nSheikh Quaderi: There is no harm in using halal products that help revive and beautify the skin, especially if there is a need for doing so. But this should not include completely shaving the beard or removing the hair of the eyebrows as these are forbidden by sound evidence. In addition, it should not have any known bad side effects or be harmful. Similarly, plastic surgery that involves changing the normal body formation simply for the purpose of beautifying oneself, is not allowed. It is permissible, however, when it is done for the correction of a defect. [God knows best]\n\nQ: How should a Muslim consumer select halal products?\n\nDr. Ahmad Sakr: Muslims must always read product labels before buying any cosmetic or personal care product. The permission to use personal care products and cosmetics depends on the origin of their ingredients. If these ingredients are pure then they are permissible, so long as their use does not cause any harm, either to one’s health or socially. However, if they are composed of impure substances like porcine collagen, gelatin or hydrolyzed animal protein, or other similar impure constituents, they are prohibited. [God knows best]\n\nReferences:\n\nFDA 2002. Is It a Cosmetic, a Drug, or Both? CFSAN/Office of Cosmetics and Colors; July 08, 2002. (URL: http://www.cfsan.fda.gov/~dms/cos-218.html).\n\nHealth Canada 2008. Consumer Product Safety / Personal Products. (URL: http://www.hc-sc.gc.ca/cps-spc/person/index-eng.php)", "E-Code: E100\nName: Curcumin/Turmeric\nDescription: Color\nStatus: Powder or granular. Mushbooh if used as liquid,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: the solvents has to be Halal. Haraam if hidden", "E-Code: nan\nName: nan\nDescription: nan\nStatus: ingredient is pork fat based emulsifier in dry mix.", "E-Code: E101\nName: Riboflavin (Vitamin B2)\nDescription: Color\nStatus: Mushbooh (Haraam if from pork liver & Kidney,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Halal if 100% plant material)", "E-Code: E102\nName: Tartrazine\nDescription: Color\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: the solvent has to be Halal", "E-Code: E104\nName: nan\nDescription: nan\nStatus: nan", "E-Code: E110\nName: Sunset Yellow FCF / Orange Yellow S\nDescription: Color\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: the solvent has to be Halal", "E-Code: E120\nName: Cochineal / Carminic Acid\nDescription: Color\nStatus: Haraam", "E-Code: E122\nName: Carmoisine / Azorubine\nDescription: Color\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color, the solvent has to be Halal", "E-Code: E123\nName: Amaranth\nDescription: Color\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color, the solvent has to be Halal", "E-Code: E124\nName: Ponceau 4R / Cochineal Red A\nDescription: Color\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color, the solvent has to be Halal", "E-Code: E127\nName: Erythrosine BS\nDescription: Color\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color, the solvent has to be Halal", "E-Code: E131\nName: Patent Blue V\nDescription: Color\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color, the solvent has to be Halal", "E-Code: E132\nName: Indigo Carmine / Idigotine\nDescription: Color\nStatus: Halal if use as is as a 100% synthetic color but if pork", "E-Code: nan\nName: nan\nDescription: nan\nStatus: glycerin is added as a solvent then it is Haraam", "E-Code: E140\nName: Chlorophyll\nDescription: Color\nStatus: Halal if use 100% powder or", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Halal if water or vegetable oil was used as a solvent", "E-Code: E141\nName: Copper Complex of Chlorophyll\nDescription: Color\nStatus: Halal if use 100% powder or", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Halal if water or vegetable oil was used as a solvent", "E-Code: E142\nName: Green S / Acid Brilliant Green BS\nDescription: Color\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color, the solvent has to be Halal", "E-Code: E150(a-d)\nName: Caramel Color/with chemicals\nDescription: Color\nStatus: Halal", "E-Code: E151\nName: Black PN / Brilliant Black BN\nDescription: Color\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color, the solvent has to be Halal", "E-Code: E153\nName: Carbon Black / Vegetable Carbon (Charcoal)\nDescription: Color\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color, the solvent has to be Halal", "E-Code: E160a\nName: Alpha, Beta, Gamma\nDescription: Color \u0096 Carotene\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color, the solvent has to be Halal", "E-Code: E160b\nName: Annatto, Bixin, Norbixin\nDescription: Color \u0096 Carotene\nStatus: Halal", "E-Code: E160c\nName: Capsanthin / Capsorbin\nDescription: Color- Carotene\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color, the solvent has to be Halal", "E-Code: E160d\nName: Lycopene\nDescription: Color \u0096 Carotene\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color, the solvent has to be Halal", "E-Code: E160e\nName: Beta-apo-8-carotenal\nDescription: Color \u0096 Carotene\nStatus: Halal if used as 100% dry powder or granular or", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Halal if vegetable oil is used as a solvent in liquid form", "E-Code: nan\nName: nan\nDescription: nan\nStatus: as a hidden ingredient. Haraam if pork gelatin is used as", "E-Code: nan\nName: nan\nDescription: nan\nStatus: hidden ingredient or carrier", "E-Code: E160f\nName: Ethyl ester of Beta-apo-8-cartonoic acid\nDescription: Color \u0096 Carotene\nStatus: Halal if used as 100% dry powder or granular or", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Halal if vegetable oil is used as a solvent in liquid form", "E-Code: nan\nName: nan\nDescription: nan\nStatus: as a hidden ingredient. Haraam if pork gelatin is used as", "E-Code: nan\nName: nan\nDescription: nan\nStatus: hidden ingredient or carrier", "E-Code: E161a\nName: Flavoxanthin\nDescription: Color\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color, the solvent has to be Halal", "E-Code: E161b\nName: Lutein\nDescription: Color\nStatus: Halal if used as 100% dry powder or granular.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if pork gelatin or pork glycerin is added in dry or liquid form", "E-Code: E161c\nName: Cryptoxanthin\nDescription: Color\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color, the solvent has to be Halal", "E-Code: E161d\nName: Rubixanthin\nDescription: Color\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color, the solvent has to be Halal", "E-Code: E161e\nName: Violaxanthin\nDescription: Color\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color, the solvent has to be Halal", "E-Code: E161f\nName: Rhodoxanthin\nDescription: Color\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color, the solvent has to be Halal", "E-Code: E161g\nName: Canthaxanthin\nDescription: Color\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color, the solvent has to be Halal", "E-Code: E162\nName: Beetroot Red / Betanin\nDescription: Color\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color, the solvent has to be Halal", "E-Code: E163\nName: Anthocyanins\nDescription: Color\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color, the solvent has to be Halal", "E-Code: E170\nName: Calcium Carbonate (Chalk)\nDescription: Color \u0096 Inorganic\nStatus: Halal if obtained from rock mineral and used as 100% dry", "E-Code: nan\nName: nan\nDescription: nan\nStatus: powder or granular. Mushbooh if used as liquid, solvent has to be Halal", "E-Code: E171\nName: Titanium Dioxide\nDescription: Color \u0096 Inorganic\nStatus: Halal", "E-Code: E172\nName: Iron Oxides and Hydroxides\nDescription: Color \u0096 Inorganic\nStatus: Halal", "E-Code: E173\nName: Aluminium\nDescription: Color \u0096 Inorganic\nStatus: Halal", "E-Code: E174\nName: Silver\nDescription: Color \u0096 Inorganic\nStatus: Halal", "E-Code: E175\nName: Gold\nDescription: Color \u0096 Inorganic\nStatus: Halal", "E-Code: E180\nName: Pigment Rubine / Lithol Rubine BK\nDescription: Color \u0096 Inorganic\nStatus: Halal if used as 100% dry color.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if used as liquid color, the solvent has to be Halal", "E-Code: E200\nName: Sorbic Acid\nDescription: Preservative\nStatus: Halal", "E-Code: E201\nName: Soduim Sorbate\nDescription: Preservative\nStatus: Halal", "E-Code: E202\nName: Potassium Sorbate\nDescription: Preservative\nStatus: Halal", "E-Code: E203\nName: Calcium Sorbate\nDescription: Preservative\nStatus: Halal", "E-Code: E210\nName: Benzoic Acid\nDescription: Preservative\nStatus: Halal", "E-Code: E211\nName: Sodium Benzoate\nDescription: Preservative\nStatus: Halal", "E-Code: E212\nName: Potassium Benzoate\nDescription: Preservative\nStatus: Halal", "E-Code: E213\nName: Calcium Benzoate\nDescription: Preservative\nStatus: Halal, if calcium obtained from mineral,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if it is obtained from bones", "E-Code: E214\nName: Ethyl 4-hydroxybenzoate\nDescription: Preservative\nStatus: Halal, if used as 100% dry powder or granular.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if alcohol is used as a solvent", "E-Code: E215\nName: Ethyl 4-hydroxybenzoate, Sodium Salt\nDescription: Preservative\nStatus: Halal, if used as 100% dry powder or granular.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if alcohol is used as a solvent", "E-Code: E216\nName: Propyl 4-hydroxybenzoate\nDescription: Preservative\nStatus: Halal, if used as 100% dry powder or granular.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if alcohol is used as a solvent", "E-Code: E217\nName: Propyl 4-hydroxybenzoate, Sodium Salt\nDescription: Preservative\nStatus: Halal, if used as 100% dry powder or granular.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if alcohol is used as a solvent", "E-Code: E218\nName: Methyl 4-hydroxybenzoate\nDescription: Preservative\nStatus: Halal, if used as 100% dry powder or granular.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if alcohol is used as a solvent", "E-Code: E219\nName: Methyl 4-hydroxybenzoate, Sodium Salt\nDescription: Preservative\nStatus: Halal, if used as 100% dry powder or granular.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if alcohol is used as a solvent", "E-Code: E220\nName: Sulphur Dioxide\nDescription: Preservative\nStatus: Halal", "E-Code: E221\nName: Sodium Sulphite\nDescription: Preservative\nStatus: Halal", "E-Code: E222\nName: Sodium Hydrogen Sulphite\nDescription: Preservative\nStatus: Halal", "E-Code: E223\nName: Sodium Metabisulphite\nDescription: Preservative\nStatus: Halal", "E-Code: E224\nName: Potassium Metabisulphite\nDescription: Preservative\nStatus: Halal", "E-Code: E226\nName: Calcium Sulphite\nDescription: Preservative\nStatus: Halal", "E-Code: E227\nName: Calcium Hydrogen Sulphite\nDescription: Preservative\nStatus: Halal, if calcium is obtained from mineral or chemicals.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if it is obtained from bones.", "E-Code: E230\nName: Biphenyl / Diphenyl\nDescription: Preservative\nStatus: Halal, if no alcohol is used as a solvent", "E-Code: E231\nName: 2-Hydroxybiphenyl\nDescription: Preservative\nStatus: Halal, if no alcohol is used as a solvent", "E-Code: E232\nName: Sodium Biphenyl-2-yl Oxide\nDescription: Preservative\nStatus: Halal, if no alcohol is used as a solvent", "E-Code: E233\nName: 2-(Thiazol-4-yl) Benzimidazole\nDescription: Preservative\nStatus: Halal, if no alcohol is used as a solvent", "E-Code: E239\nName: Hexamine\nDescription: Preservative \u0096 other\nStatus: Halal", "E-Code: E249\nName: Potassium Nitrate\nDescription: Preservative\nStatus: Halal", "E-Code: E250\nName: Sodium Nitrite\nDescription: Preservative\nStatus: Halal", "E-Code: E251\nName: Sodium Nitrate\nDescription: Preservative\nStatus: Halal", "E-Code: E252\nName: Potassium Nitrate(Saltpetre)\nDescription: Preservative\nStatus: Halal", "E-Code: E260\nName: Acetic Acid\nDescription: Miscellaneous \u0096 Acids\nStatus: Halal", "E-Code: E261\nName: Potassium Acetate\nDescription: Miscellaneous \u0096 Acids\nStatus: Halal", "E-Code: E262\nName: Potassium Hydrogen Diacetate\nDescription: Miscellaneous \u0096 Acids\nStatus: Halal", "E-Code: E263\nName: Calcium Acetate\nDescription: Miscellaneous \u0096 Acids\nStatus: Halal", "E-Code: E270\nName: Lactic Acid\nDescription: Miscellaneous \u0096 Acids\nStatus: Halal if obtained other than whey.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: In USA it is always from non dairy source.", "E-Code: E280\nName: Propionic Acid\nDescription: Preservative \u0096 Acids\nStatus: Halal", "E-Code: E281\nName: Sodium Propionate\nDescription: Preservative- Acids\nStatus: Halal", "E-Code: E282\nName: Calcium Propionate\nDescription: Preservative- Acids\nStatus: Halal if calcium obtained from mineral,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if it obtained from bones", "E-Code: E283\nName: Potassium Propionate\nDescription: Preservative- Acids\nStatus: Halal", "E-Code: E290\nName: Carbon Dioxide\nDescription: Miscellaneous\nStatus: Halal", "E-Code: E300\nName: L-Ascorbic Acid (Vitamin C)\nDescription: Antioxidants- Vitamin C\nStatus: Halal", "E-Code: E301\nName: Sodium-L-Ascorbate\nDescription: Antioxidants- Vitamin C and derivatives\nStatus: Halal", "E-Code: E302\nName: Calcium-L-Ascorbate\nDescription: Antioxidants- Vitamin C and derivatives\nStatus: Halal, if the calcium source is from mineral,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Mushbooh if it is from bones", "E-Code: E304\nName: Ascorbyl Palmitate\nDescription: Antioxidants- Vitamin C and derivatives\nStatus: Halal if saturated fatty acid Palmitic acid is obtained from plant.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if palmitic acid is obtained from pork fat", "E-Code: E306\nName: Natural Extracts rich in Tocopherols\nDescription: Antioxidants- Vitamin E\nStatus: Halal If Tocopherol is obtained from plant fat.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if Tocopherol is obtained from pork fat", "E-Code: E307\nName: Synthetic Alpha-Tocopherol\nDescription: Antioxidants- Vitamin E\nStatus: Halal only if it is made with all Halal synthetic", "E-Code: nan\nName: nan\nDescription: nan\nStatus: material without alcoholic fermentation synthetic method", "E-Code: E308\nName: Synthetic Gamma-Tocopherol\nDescription: Antioxidants- Vitamin E\nStatus: Halal only if it is made with all Halal synthetic", "E-Code: nan\nName: nan\nDescription: nan\nStatus: material without alcoholic fermentation synthetic method", "E-Code: E309\nName: Synthetic Delta-Tocopherol\nDescription: Antioxidants- Vitamin E\nStatus: Halal only if it is made with all Halal synthetic", "E-Code: nan\nName: nan\nDescription: nan\nStatus: material without alcoholic fermentation synthetic method", "E-Code: E310\nName: Propyl Gallate\nDescription: Antioxidants- other\nStatus: Halal", "E-Code: E311\nName: Octyl Gallate\nDescription: Antioxidants- other\nStatus: Halal if obtained from nutgalls or plant secretion", "E-Code: E312\nName: Dodecyl Gallate\nDescription: Antioxidants- other\nStatus: Halal if obtained from nutgalls or plant secretion.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if alcohol was used as solvent", "E-Code: E320\nName: Butylated Hydroxyanisole (BHA)\nDescription: Antioxidants- other\nStatus: Halal if only vegetable oil is used as a carrier.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if the carrier is from pork fat.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: It is not available as pure 100% chemical.", "E-Code: E321\nName: Butylated Hydroxytoluene (BHT)\nDescription: Antioxidants- other\nStatus: Halal if only vegetable oil is used as a carrier.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if the carrier is from pork fat.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: It is not available as pure 100% chemical.", "E-Code: E322\nName: Lecithin\nDescription: Emulsifiers and Stabilizers\nStatus: Halal if obtained from soy fat or egg yolk in Europe.", "E-Code: nan\nName: nan\nDescription: nan\nStatus: It is Halal in USA because it is always obtained from soy fat.", "E-Code: E325\nName: Sodium Lactate\nDescription: Miscellaneous \u0096 Salts of Lactic Acid\nStatus: Halal if the lactic acid from non dairy source", "E-Code: E326\nName: Potassium Lactate\nDescription: Miscellaneous \u0096 Salts of Lactic Acid\nStatus: Halalif the lactic acid from non dairy source", "E-Code: E327\nName: Calcium Lactate\nDescription: Miscellaneous \u0096 Salts of Lactic Acid\nStatus: Halalif the lactic acid from non dairy source and calcium from mineral", "E-Code: E330\nName: Citric Acid\nDescription: Miscellaneous \u0096 Citric Acid and its Salts\nStatus: Halal", "E-Code: E331\nName: Sodium Citrates\nDescription: Miscellaneous \u0096 Citric Acid and its Salts\nStatus: Halal", "E-Code: E332\nName: Potassium Citrates\nDescription: Miscellaneous \u0096 Citric Acid and its Salts\nStatus: Halal", "E-Code: E333\nName: Calcium Citrates\nDescription: Miscellaneous \u0096 Citric Acid and its Salts\nStatus: Halal if calcium source is not from bones", "E-Code: E334\nName: Tartaric Acid\nDescription: Miscellaneous \u0096 Citric Acid and its Salts\nStatus: Halal, if it is not obtained from wine by-product,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: in USA it is Halal because it is obtained from un-fermented grapes.", "E-Code: E335\nName: Sodium Tartrates\nDescription: Miscellaneous \u0096 Citric Acid and its Salts\nStatus: Halal, if it is not obtained from wine by-product,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: in USA it is Halal because it is obtained from un-fermented grapes.", "E-Code: E336\nName: Potassium Tartrates (Cream of Tartar)\nDescription: Miscellaneous \u0096 Citric Acid and its Salts\nStatus: Halal, if it is not obtained from wine by-product,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: in USA it is Halal because it is obtained from un-fermented grapes.", "E-Code: E337\nName: Potassium Sodium Tartrates\nDescription: Miscellaneous \u0096 Citric Acid and its Salts\nStatus: Halal, if it is not obtained from wine by-product,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: in USA it is Halal because it is obtained from un-fermented grapes.", "E-Code: E338\nName: Orthophosphoric Acid\nDescription: Miscellaneous \u0096 Phosphoric Acid and its Sailts\nStatus: Halal", "E-Code: E339\nName: Sodium Phosphates\nDescription: Miscellaneous \u0096 Phosphoric Acid and its Sailts\nStatus: Halal", "E-Code: E340\nName: Potassium Phosphates\nDescription: Miscellaneous \u0096 Phosphoric Acid and its Sailts\nStatus: Halal", "E-Code: E341\nName: Calcium Phosphates\nDescription: Miscellaneous \u0096 Phosphoric Acid and its Sailts\nStatus: Halal if calcium from mineral source", "E-Code: E400\nName: Alginic Acid\nDescription: Emulsifiers and Stabilizers \u0096 Alginates\nStatus: Halal", "E-Code: E401\nName: Sodium Alginate\nDescription: Emulsifiers and Stabilizers \u0096 Alginates\nStatus: Halal", "E-Code: E402\nName: Potassium Alginate\nDescription: Emulsifiers and Stabilizers \u0096 Alginates\nStatus: Halal", "E-Code: E403\nName: Ammonium Alginate\nDescription: Emulsifiers and Stabilizers \u0096 Alginates\nStatus: Halal", "E-Code: E404\nName: Calcium Alginate\nDescription: Emulsifiers and Stabilizers \u0096 Alginates\nStatus: Halal if calcium source is from mineral", "E-Code: E405\nName: Propane-1,2-Diol Alginate\nDescription: Emulsifiers and Stabilizers \u0096 Alginates\nStatus: Halal", "E-Code: E406\nName: Agar\nDescription: Emulsifiers and Stabilizers \u0096 other plant gums\nStatus: Halal", "E-Code: E407\nName: Carrageenan\nDescription: Emulsifiers and Stabilizers \u0096 other plant gums\nStatus: Halal", "E-Code: E410\nName: Locust Bean Gum (Carob Gum)\nDescription: Emulsifiers and Stabilizers \u0096 other plant gums\nStatus: Halal", "E-Code: E412\nName: Guar Gum\nDescription: Emulsifiers and Stabilizers \u0096 other plant gums\nStatus: Halal", "E-Code: E413\nName: Tragacanth\nDescription: Emulsifiers and Stabilizers \u0096 other plant gums\nStatus: Halal", "E-Code: E414\nName: Gum Acacia (Gum Arabic)\nDescription: Emulsifiers and Stabilizers \u0096 other plant gums\nStatus: Halal", "E-Code: E415\nName: Xanthan Gum\nDescription: Emulsifiers and Stabilizers \u0096 other plant gums\nStatus: Halal", "E-Code: E420\nName: Sorbitol\nDescription: Sugar Alcohols\nStatus: Halal", "E-Code: E421\nName: Mannitol\nDescription: Sugar Alcohols\nStatus: Halal", "E-Code: E422\nName: Glycerol\nDescription: Sugar Alcohols\nStatus: Mushbooh, called Glycerin in USA,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Halal if it is from plant fat, Haraam if it is from pork fat", "E-Code: E440a\nName: Pectin\nDescription: Emulsifiers and Stabilizers \u0096 Pectin and derivatives\nStatus: Halal", "E-Code: E440b\nName: Amidated Pectin\nDescription: Emulsifiers and Stabilizers \u0096 Pectin and derivatives\nStatus: Halal", "E-Code: E450a,b,c\nName: Sodium and Potassium Phosphates and Polyphosphates\nDescription: Miscellaneous\nStatus: Halal", "E-Code: E460\nName: Microcrystalline / Powdered Cellulose\nDescription: Emulsifiers and Stabilizers \u0096 Cellulose and derivatives\nStatus: Halal", "E-Code: E461\nName: Methylcellulose\nDescription: Emulsifiers and Stabilizers \u0096 Cellulose and derivatives\nStatus: Halal", "E-Code: E463\nName: Hydroxypropylcellulose\nDescription: Emulsifiers and Stabilizers \u0096 Cellulose and derivatives\nStatus: Halal", "E-Code: E464\nName: Hydroxypropyl-Methylcellulose\nDescription: Emulsifiers and Stabilizers \u0096 Cellulose and derivatives\nStatus: Halal", "E-Code: E465\nName: Ethylmethylcellulose\nDescription: Emulsifiers and Stabilizers \u0096 Cellulose and derivatives\nStatus: Halal", "E-Code: E466\nName: Carboxymethylcellulose, Sodium Salt\nDescription: Emulsifiers and Stabilizers \u0096 Cellulose and derivatives\nStatus: Halal", "E-Code: E470\nName: Sodium, Potassium and Calcium Salts of Fatty Acids\nDescription: Emulsifiers and Stabilizers \u0096 salts or Esters of Fatty Acids\nStatus: Mushbooh, Halal if it is from plant fat,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if it is from pork fat", "E-Code: E471\nName: Mono-and Diglycerides of Fatty Acids\nDescription: Emulsifiers and Stabilizers \u0096 salts or Esters of Fatty Acids\nStatus: Mushbooh, Halal if it is from plant fat,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if it is from pork fat", "E-Code: E472\nName: Various Esters of Mono-and Diglycerides\nDescription: Emulsifiers and Stabilizers \u0096 salts or Esters of Fatty Acids\nStatus: Mushbooh, Halal if it is from plant fat,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if it is from pork fat", "E-Code: E473\nName: Sucrose Esters of Fatty Acids\nDescription: Emulsifiers and Stabilizers \u0096 salts or Esters of Fatty Acids\nStatus: Mushbooh, Halal if it is from plant fat,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if it is from pork fat", "E-Code: E474\nName: Sucroglycerides\nDescription: Emulsifiers and Stabilizers \u0096 salts or Esters of Fatty Acids\nStatus: Mushbooh, Halal if it is from plant fat,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if it is from pork fat", "E-Code: E475\nName: Polyglycerol Esters of Fatty Acids\nDescription: Emulsifiers and Stabilizers \u0096 salts or Esters of Fatty Acids\nStatus: Mushbooh, Halal if it is from plant fat,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if it is from pork fat", "E-Code: E477\nName: Propane-1,2-Diol Esters of Fatty Acids\nDescription: Emulsifiers and Stabilizers \u0096 salts or Esters of Fatty Acids\nStatus: Mushbooh, Halal if it is from plant fat,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if it is from pork fat", "E-Code: E481\nName: Sodium Stearoyl-2-Lactylate\nDescription: Emulsifiers and Stabilizers \u0096 salts or Esters of Fatty Acids\nStatus: Mushbooh, Halal if it is from plant fat,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if it is from pork fat", "E-Code: E482\nName: Calcium Stearoyl-2-Lactylate\nDescription: Emulsifiers and Stabilizers \u0096 salts or Esters of Fatty Acids\nStatus: Mushbooh, Halal if it is from plant fat,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if it is from pork fat", "E-Code: E483\nName: Stearyl Tartrate\nDescription: Emulsifiers and Stabilizers \u0096 salts or Esters of Fatty Acids\nStatus: Mushbooh, Halal if it is from plant fat,", "E-Code: nan\nName: nan\nDescription: nan\nStatus: Haraam if it is from pork fat", "Skip to the content\n\nList of Halal and Haram Food Ingredients\n\nThe lists below have been taken with permission from the book ‘Islamic Dietary Laws and Practices’ by Mohammad Mazhar Hussaini and M S Ahmad Hussein Sakr, Ph.D .\n\nIt should be noted that a product being imported from a Muslim country is not necessarily a guarantee that it is completely Halal. In fact, food is often imported from abroad into Muslim countries without proper checking of ingredients.\n\n1. AN ALPHABETICAL DEFINITION GUIDE\n\nAn alphabetical list of Halal and Haram ingredients to look out for:\n\nBacon: A side of pig meat (pork).\n\nCholetsorol: type of fat always of animal origin. If extracted from Zabiha animal, it is Halal.\n\nDiglyceride: Emulsifier. If of animal origin it should be suspected till the source is known.\n\nGelatin (Jello Gelatin): Usually of animal origin, mostly from pig. If extracted from a dhabiha animal, then it is halal/\n\nGlycerol (Glycerine): It could be of animal, plant or Glyceryl-Stearate synthetic origin. If animal source is used, it is suspected.\n\nHormones: Usually animal hormones are used for human consumption. One has to find out the source before passing a judgement.\n\nLard: Fat from swine particulaly found in the abdominal cavity. Totally Haram for us.\n\nMagnesium Stearate (stearic acid): Used as an active ingredient in medicine tablets. Haram when derived from animal source.\n\nMono Glycerides: When derived from animal source. (Halal when the source is plant).\n\nPepsin: A digestive enzyme mostly from pig stomach.\n\nRennin (Rennet): A protein Enzyme. Usually not labeled. (In most cheeses).\n\nShortening: Fats and oils of animal origin. Animal/Lard\n\nVanilla: Extracted using alcohol.\n\nVitamins: Haram when from animal source. Mostly the source is synthetic or plant and are Halal.\n\nWhey: Used in ice creams and yogurt. Haram when from animal source.\n\n2. A PARTIAL LIST OF HALAL INGREDIENTS\n\nS/N Name of Ingredients Code No Brief Description\n\nAntioxidants: Chemical compounds used to protect certain food components from being destroyed or lost through oxidation.\n\nAscorbic acid: Vitamin C.\n\nBenzoate (Benzoic acid): Benzoic acid and sodium benzoate are used for food preservation.\n\nBiotin: A member of the B complex vitamins.\n\nBHA: An antioxidant, preservative.\n\nBHT: An antioxidant, preservative.\n\nCitric acid: Sources are plant, usually of the citrus family. (e.g. orange, lime, lemon).\n\nCobalamine: Synthetically prepared Vitamin B12.\n\nDextrin: An emulsifying, sizing, and thickening agent.\n\nFiber: Sources are plant. Provide roughage to diet.\n\nFructose: Fruit sugar.\n\nGliadin (Gluten): Ptotein found in wheat and rye.\n\nHydrogenated oil: Vegetable oil being hydrogenated making it solid at room temperature.\n\nIodine: A nutrient for thyroid gland.\n\nLecithin: Emulsifier of fat. In the USA, sources are mainly soyabean and egg yolk.\n\nLipids : Essential fatty acids found in fish, plant and animals. If source is animal; it is suspected.\n\nMalt: A kind of fermented grain.\n\nMolasses: Syrup liquid obtained in refining sugar.\n\nMSG: Flavoring. Imparts meat flavor to foods.\n\nNiacin: One of the B complex vitamins.\n\nPABA: A food supplement.\n\nPectin: A gelatinous substance extracted from fruits.\n\nPropionic acid: A preservative.\n\nRiboflavin: One of the B complex vitamins. Usually the source is synthetic.\n\nPure vegetable shortening: Source of this kind of shortening is plant.\n\n100% vegetable shortening: Source of this kind of shortening is plant.\n\nSweetener: Substance that gives a sweet taste.\n\nThiamin: One of the B complex vitamins.\n\nVanillin: Flavoring agent, extracted from vanilla.\n\nVitamin A: If source are plant and synthetic, it is halal.\n\nVitamin C: Natural sources are from plant. (e.g. citrus fruit, tomatoes, etc).\n\nVitamin D: Natural sources are yeast and fish liver oil. Also synthetically produced.\n\nVitamin E: Rich sources of Vitamin E are vegetable oils. When source is synthetic, it is halal. If source is animal, it is suspected.\n\nWater: The nutrient most vital to man’s existence.\n\nFood yeast: Microscopic, unicellular, fungal plant used for fermentation process and in baking bread.\n\nSource: SoundVision.com\n\nPrevPreviousA Select Book List about Halal and Haram\n\nNext4 Big Reasons to Choose Zabiha over Non ZabihaNext\n\nThe Council of Islamic Organization of Greater Chicago\n\n(312) 506-0070\n\ninfo@ciogc.org\n\n231 S State Street, Suite 300 Chicago IL 60604\n\nFacebook-fTwitterFlickrInstagram\n\nThe Council of Islamic Organizations of Greater Chicago 2025 © All rights Reserved.\n\nThe Council Of Islamic Organizations OF Greater Chicago is an independent, nonpartisan organization.", "Skip to main content\n\nSkip to FDA Search\n\nSkip to in this section menu\n\nSkip to footer links\n\nIn this section:\\ \\ Cosmetics Laws & Regulations\n\nHome\n\nCosmetics\n\nCosmetics Guidance & Regulation\n\nCosmetics Laws & Regulations\n\nProhibited & Restricted Ingredients in Cosmetics\n\nCosmetics Laws & Regulations\n\nWhat ingredients are prohibited or restricted from use in cosmetics? You can find the information on what the law and FDA regulations say about cosmetic ingredients and safety below.\n\nAre harmful ingredients allowed in cosmetics?\n\nWhat ingredients are prohibited or restricted by regulation?\n\nWhat about color additives?\n\nWhat about drug ingredients?\n\nWhy are different ingredients prohibited in some other countries?\n\nMore Resources\n\nAre harmful ingredients allowed in cosmetics?\n\nIt’s against the law for a cosmetic to contain any ingredient that makes the product harmful when consumers use it according to directions on the label, or in the customary or expected way. This is true whether or not there is a regulation that specifically prohibits or restricts the use of the ingredient in cosmetics.\n\nThe one exception is for coal-tar hair dyes, which the law treats differently. Under the law, FDA cannot take action against a coal-tar hair dye for safety reasons as long as it has a special warning statement on the label and directions for a skin test. The caution statement reads as follows:\n\nCaution - This product contains ingredients which may cause skin irritation on certain individuals and a preliminary test according to accompanying directions should first be made. This product must not be used for dyeing the eyelashes or eyebrows; to do may cause blindness.\n\nIt’s also important to understand that some cosmetics that are safe when people use them correctly may be unsafe when used the wrong way. Cosmetics must have any directions for use or warning statements needed to make sure people use the products safely. For example, some ingredients may be safe in products such as cleansers that we wash off the skin immediately, but not in products that we leave on the skin for hours. Similarly, ingredients that are safe for use on the hair or nails may be unsafe when used on the skin or near the eyes.\n\nUnder U.S. law, cosmetic products and ingredients, other than color additives, do not need FDA approval before they go on the market . Cosmetic manufacturers have a legal responsibility for the safety and labeling of their products. FDA can and does take action against cosmetics on the market that do not comply with the law.\n\nWhat ingredients are prohibited or restricted by FDA regulations?\n\nAlthough it’s against the law to use any ingredient that makes a cosmetic harmful when used as intended, FDA has regulations that specifically prohibit or restrict the use of the following ingredients in cosmetics:\n\nBithionol. The use of bithionol is prohibited because it may cause photocontact sensitization (21 CFR 700.11).\n\nChlorofluorocarbon propellants. The use of chlorofluorocarbon propellants in cosmetic aerosol products intended for domestic consumption is prohibited (21 CFR 700.23).\n\nChloroform. The use of chloroform in cosmetic products is prohibited because it causes cancer in animals and is likely to be harmful to human health, too. The regulation makes an exception for residual amounts from its use as a processing solvent during manufacture, or as a byproduct from the synthesis of an ingredient (21 CFR 700.18).\n\nHalogenated salicylanilides (di-, tri-, metabromsalan and tetrachlorosalicylanilide). These are prohibited in cosmetic products because they may cause serious skin disorders (21 CFR 700.15).\n\nHexachlorophene. Because of its toxic effect and ability to penetrate human skin, hexachlorophene (HCP) may be used only when no other preservative has been shown to be as effective. The HCP concentration in a cosmetic may not exceed 0.1 percent, and it may not be used in cosmetics that are applied to mucous membranes, such as the lips (21 CFR 250.250).\n\nMercury compounds. Mercury compounds are readily absorbed through the skin on topical application and tend to accumulate in the body. They may cause allergic reactions, skin irritation, or neurotoxic problems. The use of mercury compounds in cosmetics is limited to eye area products at no more than 65 parts per million (0.0065 percent) of mercury calculated as the metal and is permitted only if no other effective and safe preservative is available. All other cosmetics containing mercury are adulterated and subject to regulatory action unless it occurs in a trace amount of less than 1 part per million (0.0001 percent) calculated as the metal and its presence is unavoidable under conditions of good manufacturing practice (21 CFR 700.13).\n\nMethylene chloride. It causes cancer in animals and is likely to be harmful to human health, too (21 CFR 700.19).\n\nProhibited cattle materials. To protect against bovine spongiform encephalopathy (BSE), also known as \"mad cow disease,\" cosmetics may not be manufactured from, processed with, or otherwise contain, prohibited cattle materials. These materials include specified risk materials *, material from nonambulatory cattle, material from cattle not inspected and passed, or mechanically separated beef. Prohibited cattle materials do not include tallow that contains no more than 0.15 percent insoluble impurities, tallow derivatives, and hides and hide-derived products, and milk and milk products ** (21 CFR 700.27).\n\nSunscreens in cosmetics. Use of the term \"sunscreen\" or similar sun protection wording in a product's labeling generally causes the product to be subject to regulation as a drug or a drug/cosmetic, depending on the claims. However, sunscreen ingredients may also be used in some cosmetic products to protect the products’ color. The labelling must also state why the sunscreen ingredient is used, for example, \"Contains a sunscreen to protect product color.\" If this explanation isn’t present, the product may be subject to regulation as a drug (21 CFR 700.35). For more information on sunscreens, refer to Tanning Products.\n\nVinyl chloride. The use of vinyl chloride is prohibited as an ingredient of aerosol products, because it causes cancer and other health problems (21 CFR 700.14).\n\nZirconium-containing complexes. The use of zirconium-containing complexes in aerosol cosmetic products is prohibited because of their toxic effect on lungs of animals, as well as the formation of granulomas in human skin (21 CFR 700.16).\n\nWhat about color additives?\n\nColor additives are permitted in cosmetics only if FDA has approved them for the intended use. In addition, some may be used only if they are from batches that FDA has tested and certified. To learn more, see “ Color Additives and Cosmetics.”\n\nWhat about drug ingredients?\n\nIf a product is intended for a therapeutic purpose, such as treating or preventing disease, it’s a drug under the law and must meet those requirements, such as premarket approval by FDA, even if it affects the appearance. The presence of certain ingredients with a therapeutic use that is well-known to the public and industry is one factor that can determine whether a product is intended for use as a drug. FDA makes these decisions on a case-by-case basis. To learn more, see “ Is It a Cosmetic, a Drug, or Both? (Or Is It Soap?).”\n\nWhy are different ingredients prohibited in some other countries?\n\nDifferent countries and regions regulate cosmetics under different legal frameworks.\n\nUnder U.S. law, FDA does not have the authority to require cosmetic manufacturers to submit their safety data to FDA, and the burden is on FDA to prove that a particular product or ingredient is harmful when used as intended. We make these decisions based on reliable scientific information available to us. FDA can take other countries’ decisions into consideration, but we can only take action within the legal and regulatory framework for cosmetics in the United States.\n\nMore Resources\n\nColor Additives and Cosmetics\n\nFDA Authority Over Cosmetics\n\nIs It a Cosmetic, a Drug, or Both? (Or Is It Soap?)\n\nKey Legal Concepts: Interstate Commerce, Adulteration, and Misbranding\n\nRegulations Related to Cosmetics\n\nScience & Research\n\n\"Specified risk material\" means the brain, skull, eyes, trigeminal ganglia, spinal cord, vertebral column (excluding the vertebrae of the tail, the transverse processes of the thoracic and lumbar vertebrae, and the wings of the sacrum), and dorsal root ganglia of cattle 30 months and older and the tonsils and distal ileum of the small intestine of all cattle.\n\n** Tallow must be produced from tissues that are not prohibited cattle materials or must contain not more than 0.15 percent insoluble impurities as determined by the method entitled \"Insoluble Impurities\" (AOCS Official Method Ca 3a-46), American Oil Chemists' Society (AOCS), 5th Edition, 1997, incorporated by reference in accordance with 5 U.S.C. 552(a) and 1 CFR part 51, or another method equivalent in accuracy, precision, and sensitivity to AOCS Official Method Ca 3a-46. You may obtain copies of the method from AOCS External Link Disclaimer, 2211 W. Bradley Ave. Champaign, IL 61821\n\nBack to Top", "Honest Weight Food Co-op\n\nAll Are Welcome\n\n8am to 9pm Daily\n\n518-482-2667 Directions | Grocery Delivery Search:\n\nMenu\n\nShopping Honest Weight\n\nCurrent Sales\n\nThe Kitchen at Honest Weight\n\nCatering\n\nHonest Weight at Empire State Plaza\n\nDepartments\n\nBulk\n\nMeat & Seafood\n\nGrocery\n\nBeer & Cider\n\nWellness\n\nProduce\n\nCheese & Specialty Foods\n\nGifts\n\nPlants\n\nHow to Shop the Co-op\n\nThe Banned List\n\nFood & Product Manual\n\nWays to Save\n\nDouble Up Food Bucks\n\nStay Local\n\nBulk PLU Finder\n\nBuy Gift Cards Online\n\nAbout\n\nWhat is a Co-op?\n\nOur Mission\n\nOur History\n\nCoop Scoop Magazine\n\nCoop Scoop Archives\n\nCoop Scoop Reference List\n\nCoop Scoop Blog\n\nAnnual Reports\n\nBe the Change\n\nBlack Lives Matter\n\nCOVID-19\n\nOwnership\n\nJoin Honest Weight\n\nRefer a Friend\n\nIncentives- Perks for Member-Owners\n\nMember-Owner Resources\n\nZoom Links\n\nMember-Owner Meetings\n\nMember-Owner Needs and Opportunities\n\nBylaws\n\nMember-Owner Manual\n\nFood and Product Manual\n\nCommunity Connections Program\n\nAnti-Harassment/ Anti-Discrimination Policy\n\nAnti-Racism at HWFC: Perspectives on Race & Racism\n\nGovernance\n\nBoard\n\nBoard Meeting Minutes\n\nInside Scoop\n\nM-O Board Proposal Form\n\nGRC\n\nGRC Reports\n\nBylaws Panel\n\nCommittees of the Board\n\nCommittee Meeting Calendar\n\nHonest Slate Newsletter\n\nHonest Arts Exhibit\n\nReading Group Book Discussions\n\nHWFC Elections\n\nBoard Nomination Form\n\nGRC Elections Info\n\nClasses & Events\n\nClasses at the Co-op\n\nContact\n\nContact Us\n\nLeave us a review!\n\nE-mail Newsletter\n\nEmployment\n\nVendors\n\nMap & Directions\n\nMember-Owner Board Proposal Form\n\nThe Banned List\n\nShopping Honest Weight\n\nCurrent Sales\n\nThe Kitchen at Honest Weight\n\nDepartments\n\nHow to Shop the Co-op\n\nThe Banned List\n\nFood & Product Manual\n\nWays to Save\n\nDouble Up Food Bucks\n\nStay Local\n\nBulk PLU Finder\n\nBuy Gift Cards Online\n\nEnviro Tokens\n\nNO preservatives, artificial flavors, growth hormones, or antibiotics, EVER!\n\nWe wholeheartedly believe that you should know what’s in the food you’re eating. We’re also of the opinion that unnatural chemicals and hormones should never be in food, which is why we don’t sell them. Our Banned List of questionable ingredients leaves only 100% pure food. At Honest Weight, it’s all natural, all the time.\n\nThe following are ingredients that the Membership of HWFC has decided not to sell because they contradict the principles on which the Co-op was founded.\n\nYou can view our Food & Product Manual, read about our meat-buying policies and our GMO policy. Click the links below to learn more about why each ingredient was banned.\n\nArtificial Food Coloring\n\nArtificial Preservatives and Additives\n\nBHA (Butylated Hydroxyanisole)\n\nBHT (Butylated Hydroxytoluene)\n\nNitrites and Propionates\n\nParabens\n\nPFCs (Perfluorinated Compounds)\n\nPFOA (Perfluorooctanoic Acid)\n\nPFOS (Perfluorooctane Sulfonic Acid\n\nPTFE (Teflon)\n\nPotassium Sorbate\n\nPotassium Bromate\n\nSodium Benzoate\n\nPotassium Benzoate\n\nCalcium Benzoate\n\nArtificial Sweeteners\n\nAspartame (Nutrasweet)\n\nSaccharin (Sweet N’ Low)\n\nSucralose (Splenda)\n\nDairy Products from Cows that are given Growth Hormones\n\nHigh Fructose Corn Syrup (HFCS)\n\nHydrogenated Oil (Trans Fat)\n\nInhumane Products\n\nTobacco\n\nGenetically-Modified Farmed Fish\n\nSeafood on the Seafood Watch Avoid List\n\nWhat Honest Weight Promotes and Why\n\nBelow is an outline of what Honest Weight promotes. This and more about our buying policies can be found in our Food & Product Manual. By following these guidelines, we can ensure that the products we offer not only support good nutrition and wellness care, but that they support local farmers and responsible businesses.\n\nWhole and Minimally Processed Foods: As the basis for a healthy diet, these foods are recommended by nutritionists.\n\nOrganically Grown, Biodynamic, and Certified Naturally Grown Foods: These foods are produced without chemical fertilizers, hormones, antibiotics, synthetic pesticides, irradiation, or genetically modified organisms; all of these have been shown to be harmful to humans, animals, and the planet.\n\nNot Certified Organic, but Locally Grown with Organic Principles: We understand that the high cost of getting organic certification is not affordable for many small local farmers.\n\nOrdering, Displaying, and Selling Food in Bulk: The HWFC has consistently invested resources in maintaining a substantial volume of products in Bulk. Customers can reuse their own clean and inspected containers, serve themselves, and avoid the use of pre-packaging. Bulk foods conserve natural resources and protect the environment from excessive packaging. Many bulk foods are nutritious whole foods and are often less expensive than packaged foods.\n\nLocal, Seasonal, and Small-Scale Farming: Foods grown locally on a smaller production scale and sold in season offer several benefits;\n\nLocal produce has a shorter distance to travel, which reduces the amount of fossil fuels needed for transport.\n\nThe shorter transport time allows the produce to mature fully before being harvested and to retain higher nutritional value.\n\nSmall-scale farming focuses on diversity rather than mono-cropping. Biodiversity is better for the ecosystem and for the farmer. If one crop fails, the farm has many more to fall back on.\n\nSourcing from local small-scale farms promotes connections between consumers and farmers.\n\nLocal Producers: Local production strengthens the local economy. In addition to showcasing these producers, HWFC promotes Consumer Supported Agriculture (CSA).\n\nAffordable Price: HWFC is committed to providing nutritious food at the lowest achievable price in accordance with HWFC principles.\n\nCooperative Organizations: HWFC embraces the idea that cooperative action enhances the ability of individuals to exert control over their social and economic lives, and promotes purchasing from other cooperatives.\n\nEnvironmentally Sustainable Disposable Products and Cleaning Supplies: These products have a lighter environmental impact. Many are biodegradable, incorporate recycled materials, and use more environmentally friendly materials and production methods.\n\nFair Trade Certified and Companies Which Promote Fair Labor Practices: Fair trade products and fair labor practices offer producers and employees a living wage and humane working conditions.\n\nHealth and Nutrition Education: HWFC strives to empower customers to make better dietary and lifestyle choices by providing information related to our products and mission.\n\nPure, Simple, and Cruelty-Free Products: Personal care and household products made with few or no synthetics and minimal ingredients mean fewer health risks.\n\nMinimal Packaging: HWFC promotes reuse and recycling of containers and seeks to limit singleserving and excessive packaging.\n\nShared Information: HWFC is committed to seeking multiple perspectives on complex issues and sharing verifiable information related to our mission.\n\nTransparency: Products that have been certified to defined standards. Third-party certifications can be helpful in identifying minimum standards that consumers can use in making purchasing choices. For example, Green Seal is a non-profit organization whose mission is to work toward environmental sustainability by identifying and promoting environmentally responsible products, purchasing, and production. Manufacturers authorized to use the Green Seal Certification Mark on their products are subject to an ongoing program of testing, inspection, and enforcement. Most of the ingredients HWFC strives to avoid are prohibited under Green Seal Certification. Note that smaller manufacturers often find certification cost prohibitive and therefore forgo the certification process. Environmental Working Group (EWG) is another example of a non-profit organization engaged in research and identification of toxins in foods and consumer products. A free smartphone application is available that will identify a product’s toxicity by scanning its barcode. Seafood Watch recommendations help consumers to identify seafood that is fished or\n\nfarmed in ways that protect sea life and it’s habitats. A mobile application is available to view ratings of seafood toxicity and sourcing information.\n\nLabeling at the Point of Display: Products will be prominently labeled so that customers can easily find what they are looking for and to successfully avoid what they do not want.\n\nHumanely Raised and Cruelty-Free: The Coalition for Consumer Information on Cosmetics administers the Leaping Bunny program. Leaping Bunny has a cruelty-free standard for nearly 200 companies producing cosmetic, personal care, and household products. This assures that no animal testing is used in any phase of producer development by the company, its laboratories, or suppliers.\n\nAnimal Welfare Approved (AWA): Animal Welfare Approved has the most rigorous standards for farm animal welfare and environmental sustainability currently in use by any U.S. farm program. Their standards have been developed in collaboration with scientists, veterinarians, researchers, and farmers across the globe to maximize practicable, high-welfare farm management with the environment in mind. They are one of only two labels in the U.S. that require audited, highwelfare slaughter practices, and is the only label that requires pasture access for all animals.\n\nBanned List Ingredient Details\n\nArtificial Food Coloring: Most artificial colorings are synthetic chemicals and do not occur in nature. Critics charge that they have been inadequately tested. As one example, Yellow #5 has been implicated as an allergen, creating responses ranging from hives to death through anaphylactic shock. Effects in the developing nervous system are now being studied as a potential cause of Attention Deficit Hyperactivity Disorder. Also, some types of \"caramel color\" are artificial and contain a potentially carcinogenic chemical called 4-methylimidazole (4-MeI).\n\nArtificial Preservatives and Additives: Are toxic to human health and the environment. Natural preservatives are available and effective. Examples include ascorbic acid, hot pepper, salt, sugar, and vinegar.\n\nBHA (Butylated Hydroxyanisole): Listed as a known carcinogen in the state of California. The European Union classifies BHA as an endocrine disruptor. It is a preservative and stabilizer used in many processed foods including chips and preserved meats. It is also added to fats and to foods that contain fats and is allowed as a preservative in flavoring.\n\nBHT (Butylated Hydroxytoluene): Cousin to BHA, it too is added to food as a preservative. The two compounds act synergistically and are often used together.\n\nNitrites and Propionates: Are allergens. They can cause severe reactions in susceptible individuals and are suspected carcinogens.\n\nParabens: A synthetic preservative found in many products, from foods, to cosmetics and body products. These chemicals produce estrogenic effects and have been found in human breast cancer cell cultures. The European Food Safety Authority has set an Acceptable Daily Intake of 0-10 mg per kilogram of bodyweight per day for methyl- and ethylparaben. Typical products which contain parabens include beer, sauces, desserts, soft drinks, processed fish, jams, pickles, frozen dairy products, processed vegetables, and flavoring syrups. Propylparaben, used as a preservative in foods such as tortillas, muffins, and food dyes, is an endocrine-disrupting chemical that acts as a weak synthetic estrogen. It can alter the expression of genes and has been reported to accelerate the growth of breast cancer cells. It has also been linked to impaired fertility in women.\n\nPotassium Sorbate: A preservative used to suppress formation of molds and yeasts in foods, wines and personal care products. In-vitro studies suggest that it is toxic to DNA and has a negative affect on immunity.\n\nPotassium Bromate: An oxidizing agent used as food additive, mainly in the bread making process, and has been classified as possibly carcinogenic to humans by the International Agency for Research on Cancer. It is banned from use in foods in all countries of the EU, Canada, Argentina, and Brazil. The state of California requires warning label on any foods containing this additive. Animal studies indicate that it is toxic to kidneys and can cause damage to DNA.\n\nSodium Benzoate, Potassium Benzoate, and Calcium Benzoate: When combined with Vitamin C these form benzene, a highly carcinogenic compound that damages the mitochondria in cells.\n\nArtificial Sweeteners: Aspartame (Nutrasweet), Saccharin (Sweet N’ Low), and Sucralose (Splenda) are examples of common artificial sweeteners. The original aspartame studies showed that the drug has triggered brain, mammary, uterine, ovarian, testicular, thyroid, and pancreatic tumors. More recent studies show that aspartame increases the risk of heart attack and stroke. Studies on animals have shown that saccharin can cause cancer and it is listed as a carcinogen by the World Health Organization. The U.S. Congress intervened to permit its use in the United States with a warning label. Sucralose has not been subjected to long-term health studies in humans.\n\nNote: HWFC does carry natural low-calorie alternatives such as Maltitol, Sorbitol, Mannitol, and Xylitol. These products contribute fewer calories than sugar; however, they may have a laxative effect if consumed in large amounts.\n\nDairy Products from Cows that are given Growth Hormones: Recombinant Bovine Growth Hormone (rBGH) is used primarily to increase milk production. Its use results in increased inflammation of the udders; cows are then given antibiotics to reduce the inflammation. There is a public health concern that antibiotics are becoming ineffective because of their overuse in the treatment of animals. HWFC milk and dairy suppliers have informed us that growth hormones are not given to their cows. Note: The prohibition on rBGH does not apply to processed, pre-packaged products. HWFC cannot reliably determine the source of dairy ingredients, and therefore whether or not hormones were administered. Organic standards do not permit the use of rBGH, antibiotics, or hormones.\n\nHigh Fructose Corn Syrup (HFCS): A highly refined product with no nutritional value, derived mostly from Genetically-Modified (GMO) corn. It may unfavorably alter blood lipids, notably triglycerides, increases the risk of heart disease and contributes to obesity. Detrimental environmental effects from growing corn to produce corn syrup include soil depletion, nitrogen runoff, and herbicide and pesticide contamination. Because of increased public awareness about the potential health damaging effects of HFCS, an effort is being made by the processed food industry to create derivatives of HFCS from corn or other starches that are just as or more damaging to health than HFCS. Following are some of currently known names: maize syrup, glucose syrup, tapioca syrup, fruit fructose, crystalline fructose, fructose. All aforementioned shall be treated in the same manner as HFCS.\n\nHydrogenated Oil (Trans Fat): Scientific studies have confirmed hydrogenated oils are harmful to health. Experts recommend that any intake of trans fats be avoided. As of 2006, all manufacturers must label the presence of trans fat on the \"Nutrition Facts\" panel of packages.\n\nInhumane Products: Any product tested on animals or any product from animals raised in a CAFO (Concentrated Animal Feeding Operation).\n\nTobacco: Although additive-free sources of tobacco are available, smoke itself contains many carcinogenic compounds. According to the American Lung Association, the use of tobacco is implicated in a variety of cancers, emphysema, and asthma. The ruling of the Environmental Protection Agency (EPA) about the effects of second-hand smoke on health has resulted in the prohibition of smoking in public places.\n\nToxic chemicals:\n\nPFCs (Perfluorinated Compounds): Including the range of chemicals known as fluorotelomers, grease-resistant chemical substances linked to cancer and birth defects. Used in pizza boxes, microwave popcorn bags, sandwich wrappers, and other food packaging. There are almost a hundred PFCs used in food packaging, 3 were recently banned by the FDA. Fluorotelomers eventually breakdown to Perfluorooctanoic Acid (PFOA) and similar chemicals in our bodies and in the environment, where they are extremely persistent; as a result, they have contaminated soil, air, and groundwater at sites across the United States. The toxicity, mobility, and bioaccumulation potential of PFCs pose potential adverse effects for the environment and human health. Some of the more commonly known PFCs are:\n\nPFOA (Perfluorooctanoic Acid): Used in surface protection products such as carpet, clothing treatments, and coatings for paper and cardboard packaging. PFOA has been classified as “possibly carcinogenic to humans” (Group 2B), based on limited evidence in humans, that it can cause testicular and kidney cancer.\n\nPFOS (Perfluorooctane Sulfonic Acid): Epidemiologic studies have shown an association of PFOS exposure and the incidence of bladder cancer. There is also evidence of high acute toxicity to honey bees.\n\nPTFE (Teflon): According to tests commissioned by the EWG, Teflon surfaces for cookware and nonstick surfaces can exceed temperatures at which the coating breaks apart and emit toxic articles and gases. The toxic effects are released in just two to five minutes on a conventional stove-top at temperatures above 350F, and have been linked to pet bird deaths due to polymer fume fever.\n\nFood and Product Manual\n\nOur most recent Food and Product Manual was approved by our member-owner community and went into effect on 10/25/20. We routinely change this manual to make sure that we keep current on changes in food, vendors and farms and producers. Our current manual covers a wide range of ingredients, including artificial flavors, colors and sweeteners, and GMO ingredients.\n\nIf you have any questions or concerns about the Food and Product Manual or the products on our shelves please contact the Nutrition & Education Committee at NutritionComm@honestweight.coop\n\nClick the bottom right of the image below to view the manual in your full screen. You can use the search tool at the top of the black screen to search for specific words. Hit ESC on your keyboard to exit full page.\n\nIssuu reader embeds\n\n1 / 28\n\nRead more Publications on Issuu\n\nFlipbook byFlipbook created with\n\nPublish for free\n\nSee our Food & Product Manual full page here!\n\nFont -Font +Reset\n\nFacebook\n\n\n\nHonest Weight Food Co-op\n\n21,307 followers\n\nFollow Page Followed\n\nShare\n\n\n\nHonest Weight Food Co-op\n\non Thursday\n\n🎉 Today’s the Day! 🎉\n\nIt’s our Member-Owner & Staff BBQ Celebration — happening today in the Community Room and on the Patio from 11am–2pm and again from 4–6pm! 🌮🌽🎶\n\n✨ Bring a dessert to share for our community potluck — we can’t wait to taste your favorites!...\n\n👕 All staff will receive a brand new HWFC T-shirt\n\n🎟️ Raffle prizes throughout the event!\n\nCome celebrate with good food, good people, and lots of gratitude for our amazing co-op community 💚\n\nSee more\n\nMay be an image of 2 people and hotdog\n\nMay be a graphic of ‎2 people and ‎text that says '‎Fueled by veggies, powered by community! عاسع VN‎'‎‎\n\nMay be an image of 2 people and text\n\nMay be an image of 6 people and text that says 'Honest negt 10円 Weight 1n Welght'\n\nNo photo description available.\n\n+4\n\n36 5 1\n\n\n\n\n\nHonest Weight Food Co-op\n\non Wednesday\n\n**🍓✨ Sippin’ on Summer! ✨🌿\\\\\n\nOur **House-Made Strawberry Basil Lemonade** is the perfect blend of sweet, tangy, and refreshing! 🍓➕🌿➕🍋 Stop by Honest Weight Food Coop and grab a bottle today—your taste buds will thank you.\n\n😍 #SummerSips #LocalLove #RefreshingAF\n\n4 Comment Share\n\n\n\nIt looks like you may be having problems playing this video. If so, please try restarting your browser.\n\nClose\n\nVideo Unavailable\n\nSorry, this video could not be played.\n\nLearn more\n\n\n\nHonest Weight Food Co-op\n\non Monday\n\nThis Plastic-Free July, our small but mighty co-op is making waves—literally! ✨ Check out this incredible paper mâché whale, lovingly named “Whaley” by the kids who helped make it, crafted by local artist and co-op member, Mallory Zondag (@malloryzondag )with the help of our amazing community to highlight the impact of reducing plastic waste. Each recycled paper strip represents our collective effort to protect our oceans and planet! Did you know? Our bulk department alone h...elps remove **hundreds of plastic packages every day**, with over **500 items sold daily** package-free! That’s over 182,000 packages removed from landfills and our oceans each year!! From grains to spices, shampoo to snacks, you’re helping us reduce waste and keep our environment clean —one refill at a time. Join the movement! 🛍️ Bring your jars, bags and containers to shop plastic-free, and let’s keep making a splash for a cleaner, greener future. 💙 #PlasticFreeJuly #ZeroWasteCommunity #BulkIsBeautiful #RefillNotLandfill #SmallActionsBigImpact\n\nSee more\n\n23 1 6\n\n\n\nIt looks like you may be having problems playing this video. If so, please try restarting your browser.\n\nClose\n\nVideo Unavailable\n\nSorry, this video could not be played.\n\nLearn more\n\n\n\nHonest Weight Food Co-op\n\nabout a week ago\n\n🎉 Celebrate & Save This Fourth of July! 🇺🇸\n\nSign up for our newsletter and get a $5 off $25 coupon—perfect for stocking up on holiday weekend essentials!\n\n🧁 Don’t miss our housemade Patriotic Cupcakes—they’re festive, fluffy, and SO good. Made fresh in our bakery, and only here for a limited time!\n\n...\n\n🔥 Plus, check out all our Independence Day sales on our website!\n\n📅 Holiday Hours:\n\n🛒 Open 8am–6pm on Thursday, July 4th\n\nSee more\n\n4 Comment 2\n\n\n\nIt looks like you may be having problems playing this video. If so, please try restarting your browser.\n\nClose\n\nVideo Unavailable\n\nSorry, this video could not be played.\n\nLearn more\n\n\n\nHonest Weight Food Co-op\n\nabout 2 weeks ago\n\n🌱 @truvani Plant-Based Protein Powder is now on sale for $44.99 — and we’re throwing in a FREE protein shaker with your purchase (while supplies last)! 💪\n\nWe tried the Lemon Cookie flavor and whipped up the refreshing, creamy shake from the back of the package—and WOW. It’s so good and so summery! 🍋✨\n\nHere’s the recipe:\n\n...\n\n1 scoop Truvani Lemon Cookie Protein\n\n2 cups ice\n\n½ cup lemonade\n\n½ cup almond milk\n\n2 tbsp yogurt of your choice\n\nBlend it up and sip into something bright, cool, and protein-packed!\n\nSee more\n\n5 1 1\n\nFind us on Facebook\n\nUpcoming Classes & Events\n\nHWFC Classes & Services Calendar - PUBLIC\n\n12 Jul, Sat\n\n9 – 10:30am9am\n\nSummer Break; Returning Fall 2025 French Lessons with Sue\n\nConference Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nSaturday, July 12, today\n\n11am – 12:15pm11am\n\nGentle Yoga w Carrie\n\nTK/CR\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nSaturday, July 12, today\n\n12:30 – 1:30pm12:30pm\n\nGolf Fitness Training with Jeff Miller\n\nCommunity Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\n13 Jul, Sun\n\n11am – 12pm11am\n\nBack Pain Relief Workshop with Jeff\n\nCommunity Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nSunday, July 13\n\n2 – 5pm2pm\n\nChinese Astrology Readings w Silvia\n\nConference Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nSunday, July 13\n\n2 – 4pm2pm\n\nCooking with Allie B: Soulful Flavors & Community Connections\n\nTK/CR\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nSunday, July 13\n\n4:30 – 5:30pm4:30pm\n\nRaise The Barre with Jessica\n\nTK/CR\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nSunday, July 13\n\n6 – 8pm6pm\n\nGroup Qigong with Silvia\n\nTK/CR\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\n14 Jul, Mon\n\n11am – 2pm11am\n\nReiki w Dee\n\nConference Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nMonday, July 14\n\n11am – 12pm11am\n\nSummer Sketchbook Series; Ages 7-13\n\nCommunity Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nMonday, July 14\n\n4 – 6pm4pm\n\nAuriculotherapy with Revive Ear Seeds and Acupuncture\n\nCommunity Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\n15 Jul, Tue\n\n1 – 2:30pm1pm\n\nBhagavad Gita and Sanskrit Study Group with Akosua\n\nConference Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\n16 Jul, Wed\n\n1 – 5pm1pm\n\nAcupuncture with Sally\n\nConference Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nWednesday, July 16\n\n1:30 – 2:15pm1:30pm\n\nMagic Color Changing Lemonade for Kids!!\n\nTK/CR\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\n17 Jul, Thu\n\n12 – 3pm12pm\n\nLeague of Women Voters Tabling\n\nBy Entrance\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nThursday, July 17\n\n1 – 3pm1pm\n\nMusic Jam\n\nCR/TK\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nThursday, July 17\n\n6 – 7:30pm6pm\n\nBook Club;One Day, Everyone Will Have Always Been Against This by Omar El Akkad\n\nCommunity Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nThursday, July 17\n\n6:30 – 7:45pm6:30pm\n\nLearning to Listen; Let's End White Supremacy\n\nZoom Call\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\n18 Jul, Fri\n\n10am – 12pm10am\n\nConversational Spanish Online\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nFriday, July 18\n\n1 – 3pm1pm\n\nKnit & Stitch\n\nCommunity Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nFriday, July 18\n\n6 – 8pm6pm\n\nAnother World Isn't Possible & Gilded Rage Book readings with Brendan Byrne & Jacob Silverman\n\nTK/CR\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\n19 Jul, Sat\n\n9 – 10:30am9am\n\nSummer Break; Returning Fall 2025 French Lessons with Sue\n\nConference Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nSaturday, July 19\n\n10am – 1pm10am\n\nNew Owner Orientation CR- YES it's happening\n\nCommunity Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\n20 Jul, Sun\n\n11am – 12pm11am\n\nKids Gardening & Nature Club\n\nTK/CR\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\n21 Jul, Mon\n\n11am – 2pm11am\n\nCANCELLED Reiki w Dee\n\nConference Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nMonday, July 21\n\n11am – 12pm11am\n\nSummer Sketchbook Series; Ages 14-18\n\nCommunity Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nMonday, July 21\n\n2:30 – 5pm2:30pm\n\nSewing Support with Becky!\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nMonday, July 21\n\n6 – 7pm6pm\n\nNoteworthy Resources;Men's Mental Wellness Meet-up\n\nConference Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nMonday, July 21\n\n6:30 – 9pm6:30pm\n\nOpen Mic Coffee House in the CAFE!\n\nThe Cafe @ Honest Weight Food Co-op\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nMonday, July 21\n\n6:30 – 8:30pm6:30pm\n\nCapital District Earth Repair Meetup\n\nCommunity Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\n22 Jul, Tue\n\n6:30 – 8pm6:30pm\n\nLeague of Women Voters Meeting\n\nTK/CR\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\n23 Jul, Wed\n\n1 – 5pm1pm\n\nAcupuncture with Sally\n\nConference Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nWednesday, July 23\n\n2 – 3:30pm2pm\n\nAdventure with Iranian Dishes – Cooking, Serving & Hospitality with El\n\nTeaching Kitchen\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nWednesday, July 23\n\n7 – 8:30pm7pm\n\nReiki & Sound Meditation\n\nTeaching Kitchen/Community Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\n24 Jul, Thu\n\n6:30 – 8:30pm6:30pm\n\nCompassionate Communication; NonViolent Communication Meetings\n\nConference Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nThursday, July 24\n\n7:30 – 8:30pm7:30pm\n\nStock Research 101\n\nCommunity Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\n25 Jul, Fri\n\n10am – 12pm10am\n\nConversational Spanish Online\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nFriday, July 25\n\n1 – 3pm1pm\n\nKnit & Stitch\n\nCommunity Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nFriday, July 25\n\n4 – 5:30pm4pm\n\nYin Yoga with Linda\n\nTK/CR\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nFriday, July 25\n\n6 – 8pm6pm\n\nUpstate NY Get Lit Book Club\n\nCommunity Room\n\nCalendar: HWFC Classes & Services Calendar - PUBLIC, Accepted\n\nRead more about classes »\n\nHWFC Fresh News\n\nResilience\n\nBy Ann Lapinski When I hear the word resilience, I think of bouncing back from a difficult circumstance. Resilience is our ability to adapt well when faced with significant stressors or...\n\nProduct Recall: Select Bunny-Luv & Cal-Organic Carrots\n\nProduct Recall Grimmway Farms has issued a national recall on Organic Carrots, which includes the following two brands we carry: \"Bunny-Luv\" 1lb bag Organic Baby Peeled Carrots (with \"Best If Used By:\"...\n\nWhat’s Fresh: Canine Supplements\n\nOct 29\n\nBy Pat Ellis Our focus in this issue is to highlight opportunities that help create calm during periods of stress we all experience from time to time. Those of us...\n\nAn Update on Apeel\n\nOct 22 by the Editorial Team After an article in the summer 2024 edition of the Coop Scoop examined issues around Apeel spray, our Produce Manager, Brendan Kelly, wishes to offer these...\n\nView All News »", "Skip to content\n\nWith the rise of halal makeup revolutionizing the beauty industry, it’s time to understand what makes makeup haram in the first place—or in other words, haram ingredients in makeup.\n\nAs consumers, understanding the prohibited ingredients is essential to make sure you’re buying a halal product.\n\nFrom animal-derived substances to certain chemicals, the makeup aisle can be a maze of potential pitfalls.\n\nIn this article, we’ll explore all haram ingredients in makeup, shedding light on what to watch out for and empowering you to make informed choices that align with your values.\n\nWhether you’re a makeup maven or just dipping your toes into the beauty world, it’s crucial to know what goes on your skin, and we’re here to help with that!\n\nTable of Contents\n\nToggle\n\nHaram Ingredients in Makeup\n\n\n\nHere’s a roundup of the most common haram ingredients in makeup:\n\nCollagen\n\nCollagen, a protein renowned for enhancing skin elasticity, diminishing wrinkles, and boosting skin hydration, has become a staple in cosmetic and personal care products.\n\nHowever, the source of this ingredient is crucial, as it can potentially render a product haram.\n\nTypically derived from animal cartilage, collagen raises concerns for those adhering to Islamic dietary principles.\n\nIf sourced from a plant, it’s deemed safe and halal. Additionally, if the collagen originates from an animal slaughtered in an Islamic manner, it retains its halal status.\n\nOn the other hand, collagen obtained from pigs is unequivocally haram.\n\nCarmine\n\nCarmine, the vibrant red pigment commonly found in lipsticks and cosmetics, poses an issue for those conscious of halal practices.\n\nDerived from the dried scales of a beetle named Cochineal, carmine raises concerns due to its insect origin.\n\nWhile the ingredient is generally accepted in eye shadows, its presence in lipsticks, which can be ingested, may be an issue.\n\nIslamically, consuming insects is discouraged, with the exception of locusts, as mentioned by Prophet Muhammad ﷺ according to the majority of scholars. Therefore, the use of carmine in lip products may conflict with these principles.\n\nSay goodbye to hijab fashion dilemmas! Elevate your style effortlessly with our latest elegant hijab collections. Whether it’s sophistication or modern flair you seek, we’ve got the perfect solution for your upcoming event.\n\nStearic Acid\n\nStearic Acid, a versatile fatty acid, plays a significant role in cosmetics and personal care products, serving as a thickening agent, hardening agent, and even contributing to fragrance.\n\nHowever, the origin of this ingredient holds the key to its halal status.\n\nPrimarily derived from animal sources, stearic acid can also be sourced from plants.\n\nIf the stearic acid comes from a plant source, the product is considered halal. Similarly, if sourced from an animal, it must adhere to Islamic slaughter methods to maintain its halal status.\n\nOn the other hand, if it’s sourced from an animal not slaughtered according to Islamic rulings, it’s considered haram.\n\nGlycerin\n\nGlycerin, a colorless and odorless liquid, is a common moisturizing agent in skincare products. Like stearic acid, the halal status of glycerin relies on its source, which can be either plant or animal-based.\n\nBefore buying, it’s important to explore whether the glycerin in a product is derived from plant sources, making it halal, or from animal sources, requiring verification of Islamic slaughter methods for halal assurance.\n\nEthanol\n\nEthanol and its derivatives – ethyl alcohol, ethylene, and methylated spirits – are common ingredients in many products, ranging from shampoos and deodorants to lotions and creams.\n\nHowever, the permissibility of these substances is a subject of controversy within the Islamic community.\n\nSome scholars firmly deem ethanol as haram, while others adopt a more lenient stance, permitting its use in small quantities that do not induce intoxication.\n\nThis diversity of opinions extends to beauty products, where some scholars permit its inclusion, acknowledging its minute concentration, while others maintain restrictions.\n\nOther Haram Ingredients in Makeup to Watch Out For\n\n\n\nIn addition to the well-known haram ingredients like collagen, carmine, stearic acid, and glycerin, there are several others that merit attention in everyday personal care products.\n\n1. Casein, Oleic Acid, Lauric Acid, and Gelatin\n\nSome ingredients, including casein, oleic acid, lauric acid, and gelatin, find their way into numerous cosmetics and personal care products.\n\nThe challenge lies in their diverse sources, which may be either animal or plant-based.\n\nUnfortunately, most products do not explicitly list the source of these ingredients, making it challenging for consumers to determine the halal status.\n\n2. Moisturizers and Skin Creams with Dairy: Enzymes and Microorganisms Concerns\n\nMoisturizers and skin creams containing dairy pose an additional layer of concern. The enzymes and microorganisms used in processing dairy raw materials may be haram, with rennet being a prime example.\n\nTypically derived from calf stomachs, if the calves were not slaughtered in accordance with halal requirements, rennet and any products made with it become haram.\n\nRecommended: Are fake nails haram in Islam?\n\n3. Haram Ingredients in Makeup: An Elaborate List\n\nBeyond the familiar names, other haram ingredients in makeup include those derived from dogs (fur), porcine or pig, humans (blood, for example), and any animal not slaughtered according to Islamic rights.\n\nIt’s important to note that any ingredients using these prohibited ingredients in their manufacturing process are also not allowed under Islamic rulings,\n\nHow Is a Product Deemed Halal?\n\nThe term ‘halal,’ meaning ‘permissible’ in Arabic, signifies what is allowed under Islamic law. While widely recognized in the context of food, its application extends to cosmetics and makeup as well.\n\nCosmetics, including products like lipstick, are subject to halal considerations. Lipstick, for instance, might inadvertently be consumed while eating or drinking, prompting Muslim women to meticulously research its ingredients for adherence to halal standards.\n\nPerfumes may also pose an issue because of their alcohol content.\n\nFor halal-conscious consumers, alcohol-free perfumes are a sought-after choice. This preference stems from the fact that fragrances can be inhaled incidentally, and Islamic dietary law prohibits the ingestion of intoxicating substances.\n\nOn top of that, numerous animal species, including hogs, predatory mammals, reptiles, and insects, are considered haram.\n\nEven animals deemed acceptable under halal requirements must undergo a prescribed slaughter method known as ‘dhabīḥah.’ This process involves suspending the animal and draining it of blood, as blood is considered haram.\n\nCheck Our Newest Hijab Collection\n\nIngredients Often Found in Halal Products\n\nHalal products include a rich array of ingredients sourced from nature, ensuring adherence to Islamic dietary principles. Here’s a breakdown of some frequently used halal makeup ingredients:\n\n1. Marine Algae\n\nSpirulina\n\nChlorella\n\nVarious types of seaweed\n\n2. Nuts\n\nPeanuts\n\nAlmonds\n\nSoybeans, and other nuts\n\n3. Beans\n\nSoya beans\n\nGreen beans\n\nRed beans\n\n4. Fish-Derived Ingredients\n\nFish gelatin, sourced from permissible fish\n\n5. Crustaceans\n\nCrabs\n\nLobsters\n\nShrimps\n\nBarnacles\n\n6. Other Seafood\n\nClams\n\nOysters\n\nSnails\n\nAs you can see, sticking to Islamic rulings can be a bit challenging amid a market full of haram products. As long as you know what ingredients to watch out for, you’ll ensure that you’re sticking to Islamic practices.\n\nShare on WhatsAppShare on FacebookShare on TwitterEmail to a FriendPin on Pinterest\n\n\n\nHabiba ElMessiry\n\n10 years a hijabi and 5 years a writer—both get easier over time!\n\nRead More\n\nHijabi model wearing flowing EMMA scarf Starry Night inspired by Van gogh\n\nA Better Version Of Myself\n\n6th year in my hijab. Hijab builds me, it protects me. Flash back, 6 years ago… I was afraid of [...]\n\n6 Comments\n\nNesma Khedr in her EMMA scarf Atlantic\n\nNesma Khedr’s Hijab Story\n\n❤ الحمد لله الذى بنعمته تتم الصالحات …. قلعته بعد ١٦ سنه حجاب و لبسته تانى بعد ٨ شهور [...]\n\n35 Comments\n\nthe sunrise with the words allah everthing in the middle\n\nGreater Than All\n\nAs these very special 10 days of Dhul Hijja unfold, I’m intrigued to explore more of their hidden gifts sent [...]\n\n11 Comments\n\nLeave a Reply Cancel reply\n\nYour email address will not be published.Required fields are marked *\n\nComment *\n\nName *\n\nEmail *\n\nWebsite\n\nSearch for:\n\nHome\n\nBlog\n\nShop\n\nChiffon\n\nPrints\n\nBy Color\n\nAll Products\n\nModal\n\nPrints\n\nBy Color\n\nAll Modal\n\nSatin\n\nRewards\n\nLogin / Register\n\nFollow on FacebookFollow on InstagramFollow on TikTokFollow on TwitterFollow on PinterestFollow on YouTube\n\nContact\n\n9:30 - 17:30\n\nAbout Us\n\nContact Us\n\nCareers\n\nFAQ\n\nLogin\n\nUsername or email address *Required\n\nPassword *Required\n\nRemember meLog in\n\nLost your password?\n\nRegister\n\nEmail address *Required\n\nPassword *Required\n\nDate of birth\n\nRegister"]